{
  "message": "success",
  "data": [
    {
      "_id": "60f6dc848744d572a5098e5f",
      "id": 72001,
      "title": "How To Install Distributor in 4.0L Jeep Engine",
      "body": "<p>1) Remove spark plugs.<br />\r\n<br />\r\n2) Remove&nbsp;drive belt.<br />\r\n<br />\r\n3) Install compression tester on cylinder #1 (front cylinder).<br />\r\n<br />\r\n4) Have a helper &#39;bump&#39; the engine with the key, a little at a time, until the compression gauge needle starts to rise.<br />\r\n<br />\r\n5) Locate the TDC (top dead center) mark on the front crank pulley (harmonic balancer). The mark is likely just a notch in the metal.&nbsp;It may help to put a dab of white paint in the notch for ease of viewing.<br />\r\n<br />\r\n6) Turn the engine by hand (with a socket and ratchet on the crank pulley bolt) until the mark on the pulley lines up with the zero on the timing scale.<br />\r\n<br />\r\n7) Remove old distributor.<br />\r\n<br />\r\n8) Install new distributor. It can only go in one way. The tab must line up with the hole in the block so the retaining bolt will go in.<br />\r\n<br />\r\n9) remove plastic pin from distributor.</p>\r\n",
      "author": "quadring",
      "publishedDate": "Jul 25, 2009 2:13:12 PM",
      "published": 1
    },
    {
      "_id": "60f6e7788744d572a5098e61",
      "id": 72002,
      "title": "Chrysler Jeep Dodge Security Systems - VTSS  SKIM  SKREEM  Keyless Go",
      "body": "<p><strong>VTSS (Vehicle Theft Security System)</strong></p>\r\n\r\n<p>Sounds the horn when system is triggered</p>\r\n\r\n<p>RKE (Remote Keyless Entry) FOBs (AKA remotes) lock and unlock doors (and arm/disarm security system)</p>\r\n\r\n<p>FOB = Finger Operated Button</p>\r\n\r\n<p>Exterior lock cylinders (front doors and trunk/liftgate) have key position switches in case remote fails or is not available. Vehicle may have VTSS module, or VTSS functions may be handled by other vehicle modules, such as BCM and PCM. Has security light on instrument cluster or top of dash. No glass breakage sensing or vibration/impact sensing. It is generally not possible to disable VTSS or &#39;remove&#39; it from the vehicle. If the BCM is replaced, VTSS can be &#39;not enabled&#39; at that time (on some vehicles.)</p>\r\n\r\n<p>VTSS is common on older vehicles (1990&#39;s thru early 2000&#39;s)</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>SKIM (Sentry Key Immobilizer Module) system</strong></p>\r\n\r\n<p>Basically the same as VTSS described above. The main difference and largest advance is that it uses a gray colored key, with an RFI chip inside the key. The SKIM module is located on the steering column and has a halo ring which encircles the ignition lock cylinder. The halo ring is the antenna which reads the chip inside the key. The keys must be programmed to the vehicle with the appropriate scan tool. The dealer scan tool (DRB3) is preferred. A 4 digit PIN (assigned to each vehicle at the factory) is required to program keys. The PIN is available from the Chrysler TechConnect website (user ID and password is required).</p>\r\n\r\n<p>Actually, since the keys are unpowered (no battery), the keys are not actually programmed. The vehicle is programmed to accept the key(s). Vehicles with SKIM system will not operate without a programmed key, which makes them much harder to steal.</p>\r\n\r\n<p>Bypassing (or physically beaking and turning) the ignition lock cylinder will cause the engine to start, run for two seconds, then stall. repeated attempts will cause a no-crank condition.The same thing happens if an unprogrammed key is used.</p>\r\n\r\n<p>The gray skim key is accompanied by a remote FOB. A seperate module is generally used to receive signals from the remote FOB.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>SKREEM (Sentry Key Remote Entry Module)</strong></p>\r\n\r\n<p>Very similar to the SKIM system. Around 2004-2005, the remote FOB was integrated with the sentry key (key and remote became one piece).</p>\r\n\r\n<p>Also, the SKREEM (still mounted on the steering column) now receives the signal from the remote FOB, as well as excites the RFI chip inside the key.</p>\r\n\r\n<p>The batteries inside the key are for the remote transmitter only. Dead or missing batteries do not affect the ability to start the engine.</p>\r\n\r\n<p>Key position switches on the exterior lock cylinders were deleted. It is assumed that since the key and FOB are integrated, the remote will be used to unlock the doors (and disarm the security system). In the event the key&#39;s batteries are dead, or the remote portion of the key is otherwise inoperative, the security system may be triggered (horn sounding and lights flashing) if the key is used in the door. To disarm, insert the key in the ignition, and turn to the &#39;ON&#39; position. The SKREEM will detect the programmed key and disarm the security system.</p>\r\n\r\n<p>Most SKREEM vehicles have only one exterior lock cylinder, on the driver&#39;s door.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>WIN and FOBIK</strong></p>\r\n\r\n<p>(Wireless Ignition Node and Finger Operated Button Integrated Key)</p>\r\n\r\n<p>Inroduced for the 2008 model year</p>\r\n\r\n<p>Metal key no longer needed for day-to-day operation.</p>\r\n\r\n<p>The SKIM/SKREEM and the ignition switch have been integrated into one unit and mounted in the dash to the right of the steering column.</p>\r\n\r\n<p>The FOBIK is inserted into the WIN and turned to ON and START similar to an ordinary key.</p>\r\n\r\n<p>Any FOBIK can be physically inserted into any WIN, though of course, the vehicle must be programmed to accept the FOBIK.</p>\r\n\r\n<p>FOBIKs have a metal key hidden inside, so the driver door can be unlocked manually if necessary.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Keyless Go</strong></p>\r\n\r\n<p>Same as WIN and FOBIK, except now the FOBIK does not need to be inserted and turned in the WIN. The WIN has a pushbutton for ignition ON and engine starting. The FOBIK must be inside the vehicle, and is sensed by three antennas which report to the PEM (Passive Entry Module).</p>\r\n\r\n<p>Some system faults/failures require the pushbutton to be popped out, and the FOBIK to be inserted in the WIN.</p>\r\n\r\n<p>The newest Keyless Go systems have pushbutton starting ONLY. The button cannot be removed.</p>\r\n\r\n<p>Some vehicles also can sense the FOBIK and unlock the doors (when a button on the door handle is pressed). In this case, you never need to remove the FOBIK from your pocket or purse.</p>\r\n",
      "author": "quadring",
      "publishedDate": "Jun 23, 2009 4:44:40 PM",
      "published": 1
    },
    {
      "_id": "60f6fd18088aec86a94ff5e4",
      "id": 72003,
      "title": "Electrical Diagnosis",
      "body": "<p>Here are some tips for tracing an electrical problem:</p>\r\n\r\n<p>Review the wiring diagram.&nbsp; Unplug the PCM and the O2 sensor.&nbsp; Use a digital volt-ohm meter (DVOM) on the &#39;ohms&#39; setting to check the continuity of the wires which run between the PCM and the O2 sensor.&nbsp; The meter should read close to zero ohms.</p>\r\n\r\n<p>Connect the black lead of the meter to battery negative.&nbsp;Set the meter to DC volts.&nbsp; Turn the key on.&nbsp; Check all of the wires at the O2 for voltage.&nbsp; With the PCM and O2 unplugged, there should be NO voltage on any of the wires, except maybe the power to the O2 heater.&nbsp; Voltage on any other wire could point to a short in the wiring harness.</p>\r\n\r\n<p>Use the DVOM on &#39;ohms&#39; setting again.&nbsp; Check&nbsp;all the&nbsp;wires in the O2 connector for continuity to each other.&nbsp; The meter should read OL or infinity.&nbsp; Any other&nbsp;reading could point to a short circuit in the wiring harness.</p>\r\n\r\n<p>From an auto parts store, obtain an old-style sealed beam headlight.&nbsp; Use this and some wire to make a&nbsp;&#39;real&#39; test light.&nbsp; This is called &#39;load-testing&#39; the wiring.&nbsp;&nbsp;If the wire you are checking will power a sealed beam headlight to full brightness, then the wire is most likely intact.&nbsp; Of course, be sure the PCM and O2&nbsp;are unpluged&nbsp;first.&nbsp; Jump power to one end of the wire you are checking, then use the headlight as a test light to check the other end of the wire.&nbsp;</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jun 24, 2009 9:19:07 AM"
    },
    {
      "_id": "60f710a08b04acda0549bd4e",
      "id": 72004,
      "title": "PCI Bus Diagnosis - An AutoFixList.com Exclusive ",
      "body": "<p><strong>How to Fix the &quot;Famous Jeep Grand Cherokee Electrical Problem&quot;</strong></p>\r\n\r\n<p>PCI Bus Diagnostics for 1999-2004 (WJ) Jeep Grand Cherokee</p>\r\n\r\n<p>The PCI Bus system is a one-wire communication system. It allows the various modules (computers) on the vehicle to communicate with each other and share information. This information sharing reduces wiring complexity.</p>\r\n\r\n<p>The PCI Bus wire is either&nbsp;yellow with a violet tracer, or&nbsp;white with a violet tracer,&nbsp;depending on year and model. The easiest place to access this wire is at the data link connector, which is the connector that the scan tool plugs into for diagnosis. On LHD North American Jeeps, the data link connector is located under the driver side of the dash, adjacent to the fuse block. It is easily visible without removing any panels.</p>\r\n\r\n<p>The PCI Bus wire is in pin #2 of the data link connector. Normally I remove the connector from it&#39;s bracket and pull it down for better access. This allows me to&nbsp;<strong>backprobe&nbsp;</strong>the connector with my voltmeter. You do not want to damage the portion of the terminals which make contact with the scan tool connector.</p>\r\n\r\n<p>Here are the symptoms you are probably experiencing with a PCI Bus issue:</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<p>The A/C blows normal volume but the air is not cold, because the compressor will not engage, even with the &#39;snowflake&#39; or &#39;A/C&#39; button pressed.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>The instrument cluster backlighting is ON at all times (when the key is on), even with the headlamps OFF.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Power windows are inoperative.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>The overhead console displays &#39;lines&#39; instead of information.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>The gauges are not reading correctly.</p>\r\n\t</li>\r\n</ol>\r\n\r\n<p><br />\r\nThese symptoms may come and go. Often PCI bus problems are intermittent.</p>\r\n\r\n<p>The PCI Bus system operates on a 0 to 7.5 volt square wave. If you were to connect an oscilloscope to pin 2 of the data link connector, on a system with no problems, the oscilloscope would display a nice square wave. Most people do not have a $2000 scope, so I have devised an easier method. You will need a digital voltmeter to continue.&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<p>Set the meter to &#39;DC Volts&#39;</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Connect the red lead of the meter to pin 2 of the data link connector</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Connect the black lead of the meter to ground. Any bare metal surface under the dash will work.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Turn the key to &#39;ON&#39;. Or, start the engine. Sometimes the PCI Bus problem is easier to duplicate with the engine running.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Observe the volt reading on the meter.</p>\r\n\t</li>\r\n</ol>\r\n\r\n<p><br />\r\nIf the volt reading is zero, or very close to zero, it is possible that the PCI bus is OPEN, or SHORTED TO GROUND. A different test will be required, which is detailed later in this article.</p>\r\n\r\n<p>If the volt reading is close to 12 volts, or battery voltage, the PCI Bus is shorted to voltage, and diagnosis should be fairly easy.</p>\r\n\r\n<p>If the volt reading is varying between 0.5 and 2.5 volts, the fault is not present at this time. Verify this by inspecting the operation of the windows and other symptoms.</p>\r\n\r\n<p>Normally what I see on problem vehicles is a reading of 4 to 6 volts. This indicates that a module (one of the vehicle computers) is pulling the bus voltage too high, causing interference and a loss of communication between modules, which leads to the symptoms you are experiencing.</p>\r\n\r\n<p>If the PCI Bus voltage reading is consistently above 2.5 volts, we need to determine which module is causing the problem. There is no quick way to do this. Each module on the bus must be unplugged until the voltage returns to the 0.5 to 2.5 and fluctuating range.</p>\r\n\r\n<p>Module examples are:</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<p>PCM (engine computer)...engine compartment</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>TCM (transmission computer)...engine compartment</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>BCM (body computer)...under dash near fuse block</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>ABS (antilock brake computer)...engine compartment</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Instrument cluster</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Airbag computer...under center console/armrest</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Driver door module (the window switch assembly)...remove door panel to access</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Passenger door module (the window switch assembly)...remove door panel to access</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Radio</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Audio amplifier...under back seat</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>A/C control head...in dash</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Overhead console computer</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Immobilizer module...remove steering column covers to access</p>\r\n\t</li>\r\n</ol>\r\n\r\n<p>I begin with the interior modules, unplugging the ones that are easiest to get to. Continue to unplug modules until the bus voltage lowers to a normal level; 0.5 to 2.5 volts and fluctuating up/down randomly. Keep in mind that unplugging some modules will cause other symptoms...try to ignore those for now and focus on the voltage reading.</p>\r\n\r\n<p>Once you find a suspect module, reconnect everything else and observe the bus voltage. Reconnect the suspect module and try to duplicate the symptoms. Verify that the suspect module is actually the problem several times before you spend money on a replacement part. Be sure to cycle the ignition key every once in a while during testing.&nbsp;<strong>The trick here is to be able to consistently verify that the bus problem is present, then verify that it is not present when the suspect module is unplugged. Try to not let the system &#39;fool&#39; you.</strong></p>\r\n\r\n<p>If the bus voltage is around 12 volts, or is the same as battery voltage, and ALL modules are unplugged, then the bus wiring is shorted to voltage. This problem may not be easy to find. You will have to trace the bus wire extensively. The good news is that this scenario is very unlikely.</p>\r\n\r\n<p>If the bus voltage is always near 0 volts, a different method will work.</p>\r\n\r\n<p>Disconnect the vehicle battery under the hood.</p>\r\n\r\n<p>Connect your meter the same way, but switch to the &#39;ohms&#39; setting, to check the resistance of the bus. A bus that is shorted to ground will have a very low resistance, possibly below 10 ohms. In a situation where the bus is shorted to ground, a module could be at fault, but more likely the bus wire has rubbed through somewhere and is touching bare metal. Keep in mind that the whole frame and body of the vehicle is ground, so that makes this scenario more likely.</p>\r\n\r\n<p>If the ohm reading is &#39;OL&#39; meaning infinite resistance, then the bus wire is OPEN and must be traced out for continuity. However...if every module is unplugged, and the bus wiring is OK, the meter will display &#39;OL&#39; for bus resistance.</p>\r\n\r\n<p>Read the following information, which is from Chrysler:</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<table border=\"0\" cellpadding=\"3\" cellspacing=\"0\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<table border=\"1\" cellpadding=\"3\" cellspacing=\"3\">\r\n\t\t\t\t<tbody>\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t<td>\r\n\t\t\t\t\t\t<p>Measuring PCI voltage is the first place to go if no communication is possible with any modules. This tells what type of failure has occurred and this dictates the next step. If communication is possible with only one module, an open in the bus is likely.PCI bus vehicle are very easy to diagnose bus problems on. Since each module has a termination resistor of a standard value a measurement of bus resistance (with the battery disconnected) gives a very good idea of the condition of the bus. For example: Termination resistance 350 to 750 ohms would be a normal bus. 0 ohms would indicated a shorted bus OL would indicate an open bus 3300 ohms would be one dominant module only 10800 ohms would be one non-dominant module only</p>\r\n\t\t\t\t\t\t</td>\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t</tbody>\r\n\t\t\t</table>\r\n\r\n\t\t\t<p><br />\r\n\t\t\t&nbsp;</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jun 25, 2009 10:01:50 AM"
    },
    {
      "_id": "60f7112a8b04acda0549bd4f",
      "id": 72005,
      "title": "The Basics of Electronic Fuel Injection Explained ",
      "body": "<p>What is fuel injection? Fuel injection is a method of supplying fuel to an internal combustion engine. Proper operation depends on controlling the air/fuel ratio precisely. Electronic fuel injection excels at this task.</p>\r\n\r\n<p>Up until about 1980, most cars and trucks relied an a carburetor to supply fuel and air to the engine. A carburetor is a mechanical device that relies on venturi vacuum (air passing through it) to create a low-pressure zone which sucks fuel into the airstream.</p>\r\n\r\n<p>As with any mechanical device, periodic adjustments and cleanings were necessary to maintain proper operation, hence, the carburetor rebuild.</p>\r\n\r\n<p>At the very end of the carburetor&#39;s reign, electronic controls were added to improve control in an effort to keep the fuel air ratio at 14.7 to 1. These controls were rudimentary at best and were the root cause of many driveability problems.</p>\r\n\r\n<p>A better solution was in order. The computer revolution of the 1980&#39;s brought with it more and more processing speed at a lower cost. It was proven that a small computer, an ECU, could easily handle the calculations necessary to control an engine.</p>\r\n\r\n<p>The first engine computers were called ECUs (Engine Control Unit, or Electronic Control Unit). The terminology varied between manufacturers and over time. They were also called ECMs (Engine Control Module), which later became PCMs (Powertrain Control Module) as electronic controls were inevitably added to the transmission as well.</p>\r\n\r\n<p>Basics of Fuel Injection</p>\r\n\r\n<p>Relatively few components are needed to have a simple fuel injection system:</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>One or more injectors mounted in a throttle body, which is bolted to the intake manifold in place of the carburetor.</li>\r\n\t<li>\r\n\t<p>An electric fuel pump located in the fuel tank to pressurize the fuel line(s) and the injector.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Coolant temperature sensor (more fuel must be injected in when the engine is cold, less when it is hot).</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Throttle position sensor (so the ECU knows the driver&#39;s intentions).</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Intake manifold vacuum sensor (MAP sensor), or an airflow measuring device near the air filter (MAF or Mass Airflow Sensor).</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>An engine position sensor, (so the ECU knows when the engine is spinning.)</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>An ECU that is programmed to monitor the inputs from the 4 sensors, and control the fuel injector(s) accordingly.</p>\r\n\t</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>It was quickly determined that with the proper programming, the ECU controlled the engine perfectly. Gone were the days of hard starting, vapor lock, bogging on acceleration, etc. Another benefit was the ECU would adjust for changes in barometric pressure caused by weather or elevation changes (i.e., driving in the mountains).*</p>\r\n\r\n<p>*The MAP (Manifold Absolute Pressure) sensor takes a &#39;snapshot&#39; reading of current barometric (atmospheric) pressure when the key is switched to the &#39;on&#39; position. When the engine is spinning (or running), the MAP sensor measures the pressure (vacuum) in the intake manifold, which is all of the area in between the throttle blade and the engine&#39;s intake valves (or pistons when the intake valve is open). The MAP sensor is one of the most important sensors on a fuel injection system. Some early systems used a MAP sensor and a BARO sensor, but it was found that the MAP sensor could easily perform both functions, since in an engine that is not spinning, the pressure in the intake manifold is exactly the same as barometric pressure. The MAP sensor updates the BARO reading at every key on. Modern systems also update the BARO reading at full (wide-open) throttle. In an engine operating at wide-open throttle, the MAP reading and the actual outside BARO pressure are very similar. The software in the PCM can compensate for any actual variance. The benefit of this is improved control of the air/fuel ratio when the elevation (and hence the barometric pressure) is changing, but no key-off/key-on cycle ocuurs.</p>\r\n\r\n<p>Our basic, hypothetical fuel injection system is operating nicely. The engine runs equally well hot or cold, and starts easily after a hot soak. It is returning good fuel economy. But it isn&#39;t good enough yet...we need to add a few things.</p>\r\n\r\n<p>We need to be able to communicate with the ECU for diagnostic purposes, in case something goes wrong. An electrical connector was added (DLC, or Data Link Connector). Since people don&#39;t speak in computer language (zeros and ones) a scan tool was needed that translates computer language to our language. Programming was added to the ECU to allow it to communicate with the scan tool, so we can see what the computer sees, the sensor readings.</p>\r\n\r\n<p>Further programming allows the ECU to generate fault codes (trouble codes, DTCs) that can be read with the scan tool. For example, if a fault develops with coolant temperature sensor circuit, the ECU needs to be able to actually identify it as a fault and generate a trouble code that can be retrieved with the scan tool. The actual fault could be that the sensor is unplugged, the sensor has failed, or the wiring is damaged (open), shorted to ground, or shorted to power. The ECU will constantly monitor the circuit resistance and generate a fault code such as &ldquo;coolant temperature sensor circuit&rdquo; when the overall resistance of the circuit is above or below a predetermined range.</p>\r\n\r\n<p>The next step was to add a warning, visible to the driver, to signal when something is amiss. A &#39;check engine light&#39;, known in the industry as a &#39;MIL&#39; (Malfunction Indicator Lamp) was added to the instrument cluster. When a fault occurs that could potentially affect emissions performance, or cause engine emissions to exceed legal levels, the MIL will illuminate to warn the vehicle operator that service or repairs are required.</p>\r\n\r\n<p>The ECU can now control basic engine functions, recognize and store fault codes, communicate with a scan tool, and signal the driver when a malfunction occurs. What is needed now is a bit of quality control. The ECU needs to be able to &ldquo;check it&#39;s work&rdquo;, that is, we need a way to verify that the ECU&#39;s calculations are correct, in order to keep tailpipe emissions in check and fuel economy reasonable.</p>\r\n\r\n<p>The oxygen sensor was developed and the foundation for a &ldquo;feedback&rdquo; fuel system was laid. The oxygen sensor screws into the exhaust pipe close to the engine, before the catalytic converter. It measures the oxygen content of the exhaust stream, which is directly related to how &#39;rich&#39; or &#39;lean&#39; the fuel mixture is.</p>\r\n\r\n<p>The idea is to keep the air/fuel ratio as close to 14.7 to 1 as possible. This ratio refers to weight, that is, 14.7 pounds of air are mixed with (1) pound of fuel in order to achieve normal, complete combustion. This ratio is referred to as &ldquo;stochiometry&rdquo; and it is somewhat of a compromise. The main goal is the lowest possible emissions, but it is also a good point for driveability, power, and fuel economy.</p>\r\n\r\n<p>The oxygen sensor produces a voltage when hot (which happens quickly due to it&#39;s location in the exhaust pipe) that varies between 0 and 1 volt. 0 volts means the fuel/air ratio is too lean (not enough fuel) and 1 volt indicates that it is too rich (too much fuel). Between 0.45 and 0.55 volts is ideal which indicates the engine is operating at stochiometry.</p>\r\n\r\n<p>The ECU constantly monitors oxygen sensor voltage and adjusts the fuel injector &#39;on time&#39; slightly to keep the sensor reading in the desired range.</p>\r\n\r\n<p>Now we have everything, right? It&#39;s never good enough. Progress is inevitable....</p>\r\n\r\n<p>More later.</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 26, 2009 3:49:29 PM"
    },
    {
      "_id": "60f712598b04acda0549bd50",
      "id": 72006,
      "title": "What is P0440 General Evaporative System Failure? ",
      "body": "<p>P0440 General Evaporative System Failure means that the PCM (engine computer) has expected the switch inside the NVLD (natural vacuum leak detection) device to change states, but it has not changed states.&nbsp; After the&nbsp;vehicle is parked, the PCM expects the switch to close at some point and when this does not occur, P0440 is set and the MIL (check engine light) comes on (after it fails twice).&nbsp; &nbsp;The PCM monitors this switch for functionality only.&nbsp; The circuit itself is not monitored.&nbsp; In other words, the PCM (engine computer) monitors the NVLD&nbsp;switch&nbsp;only when it is running the leak detection test.&nbsp;&nbsp; If you unplug the NVLD electrical connector, the MIL will not illuminate right away.&nbsp; The MIL will illuminate after the monitor fails (2) times.&nbsp;</p>\r\n\r\n<p>The usual cause is failure of the switch inside the NVLD.</p>\r\n\r\n<p>Replace the NVLD device to correct.&nbsp; The NVLD device is black plastic, about the size of a softball, has 2 medium size hoses attached to it and (1) electrical connector with (2) wires.</p>\r\n\r\n<p>Also do a visual inspection of the fuel tank, all lines and hoses, fuel filler cap, charcoal canister, and the purge solenoid.&nbsp; Check the hose which goes from the purge solenoid to the intake manifold.</p>\r\n\r\n<p>Where is the NVLD device located?&nbsp; PT Cruiser---on the passenger side of the fuel tank.&nbsp; Pacifica---in front of the fuel tank.&nbsp; LH body (300M, Intrepid, etc.---on top of the canister on the passenger side of the fuel tank.</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 27, 2009 8:33:19 AM"
    },
    {
      "_id": "60f712f70f1a597ec53ffc22",
      "id": 72007,
      "title": "Misfire DTCs Explained. P0301, P0302, P0303, P0304, etc.",
      "body": "<p>Misfire DTCs can be challenge to resolve.&nbsp; (DTC stands for Diagnostic Trouble Code).&nbsp; Starting in 1996, when vehicles were first equipped with OBDII (On-Board Diagnostics, 2nd generation), one of the more important new features was misfire detection.&nbsp; A misfire means that one or more of the engine cylinders is not carrying it&#39;s fair share of the engine load.&nbsp; I will use a four-cylinder engine for this discussion.&nbsp;</p>\r\n\r\n<p>Think of each of the four cylinders as seperate engines.&nbsp; Each cylinder has it&#39;s own fuel supply and ignition source.&nbsp; If a fault occurs with fuel supply, ignition (spark), compression, valve operation, etc., that cylinder will not make full power.&nbsp; The result is usually a rough idle or a feeling that the engine is not making the power that it should.</p>\r\n\r\n<p>There are varying degrees of severity of misfire, of course.&nbsp; It can range from barely noticeable to moderate to severe.&nbsp; A cylinder that is making -0- power results in a very rough idle and is referred to as a &quot;dead miss.&quot;&nbsp; You can demonstrate a temporary dead miss by unplugging the electrical connector to a fuel injector.</p>\r\n\r\n<p>Note: check engine light = &quot;MIL&quot;, which stands for &quot;Malfunction Indicator lamp.&quot;</p>\r\n\r\n<p>A misfire DTC will cause the MIL to illuminate.&nbsp; A moderate or severe misfire may cause the MIL to flash, which indicates to the vehicle operator that the PCM (engine computer) has determined the misfire is possibly causing damage to the catalytic converter.&nbsp; (Excessive unburned fuel entering the catalyst will cause damage.)&nbsp; If the MIL is flashing, the driver should consider having&nbsp;the vehicle towed.</p>\r\n\r\n<p>How does the PCM determine a&nbsp;misfire is present?</p>\r\n\r\n<p>An engine makes &#39;power pulses&#39; as it runs.&nbsp; Every time a cylinder fires on it&#39;s power stroke, the engine speeds up slighlty.&nbsp; It slows down slightly after the power stroke.&nbsp; Keep in&nbsp;mind that a cylinder &#39;coasts&#39; through the other 3 strokes.&nbsp; A&nbsp;one-cylinder engine (picture your lawn mower) coasts 75% of the time!&nbsp;&nbsp; By the way, the four strokes of engine operation are: intake, compression, power, and exhaust.&nbsp; Each stroke is 1/2 of a revolution of the crankshaft.&nbsp;</p>\r\n\r\n<p>Imagine a live graph of engine speed: a graph of time vs. speed.&nbsp; The graph of an engine running&nbsp;properly would be a line.&nbsp; Zoom in for better resolution, and little humps would be apparent.&nbsp; The humps represent the slight changes in engine speed as the power pulses come and go.&nbsp; A misfiring engine&#39;s graph would show something different:&nbsp; one of the humps would be missing (flat) indicating that the engine speed did not change during a firing stroke.&nbsp; On our four-cylinder engine with one cylinder misfiring, every fourth hump would be different.</p>\r\n\r\n<p>The PCM monitors the CKP (crankshaft position) sensor which measures crankshaft speed and position.&nbsp; When it &#39;sees&#39; a variation in the graph of engine speed, it interprets this as a misfire.&nbsp; It is looking for evenly spaced pulses of equal intensity.</p>\r\n\r\n<p>So how does one fix the problem?&nbsp; If you have one cylinder misfiring, sometimes part-swapping is a good way to get started.&nbsp; Swap the spark plugs around and retest.&nbsp; If the misfire moves to the other cylinder, then it is probably the spark plug.&nbsp; Swap ignition coils or ignition cables if possible.&nbsp; Sometimes the fuel injector is at fault.&nbsp; A compression test may be in order.&nbsp;</p>\r\n\r\n<p>If multiple cylinder misfires are present, you may need to look beyond spark, fuel and compression.&nbsp; Keep in mind that the PCM is monitoring variations in engine speed only.&nbsp; It does not know for sure if a misfire actually exists or not.&nbsp; It is up to the technician to take it to the next step.&nbsp; With OBDII vehicles, the PCM does the initial diagnosis and sets one or more DTCs.&nbsp; The technician then interprets this information and performs the appropriate testing based on experience, prior knowledge, etc.</p>\r\n\r\n<p>I have seen many cases in which a failing A/C compressor was causing misfire codes to set.&nbsp;</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 28, 2009 1:47:08 PM"
    },
    {
      "_id": "60f733ff5459a36078cd89d5",
      "id": 72008,
      "title": "Maintenance Tips",
      "body": "<p><strong>Hemi Engine (5.7L) Spark Plugs &nbsp;</strong></p>\r\n\r\n<p>This is the author&#39;s opinion based on my experience so far:</p>\r\n\r\n<p>It is not necessary to replace the spark plugs on 5.7L Hemi engines at 30,000 miles.&nbsp; At this mileage, very little wear will be seen on the plug electrodes.</p>\r\n\r\n<p>Save your time and money and wait until 50,0000 or 60,000 miles.</p>\r\n\r\n<p><strong>Don&#39;t Fool Around With Spark Plugs!&nbsp;</strong></p>\r\n\r\n<p>When it is time to replace spark plugs, use the EXACT correct spark plug.&nbsp; There is an emissions label under the hood which shows the correct part number.</p>\r\n\r\n<p>Do not bother with &#39;Split-Junk&#39; and &#39;Pulse Junk&#39; and &#39;Super Quadruple Platinum&#39; spark plugs.&nbsp; (Names have been changed to protect the guilty.)&nbsp; I have seen plenty of problems caused by people experimenting with fancy spark plugs.</p>\r\n\r\n<p>If it was possible to gain&nbsp;horsepower and&nbsp;improve miles-per-gallon&nbsp;simply by installing different spark plugs, the manufacturer would put them in at the factory.&nbsp;</p>\r\n\r\n<p>Save yourself time, money, and hassle:&nbsp; use the spark plugs that belong in that engine!&nbsp;</p>\r\n\r\n<p><strong>Make sure there&#39;s air in there! &nbsp;</strong></p>\r\n\r\n<p>Go check your spare tire right now.&nbsp; Zero psi is too low.&nbsp; The spare will do you little good if it is flat.</p>\r\n\r\n<p><strong>Something You Should Check Right Now&nbsp;</strong></p>\r\n\r\n<p>One of the most common (and frustrating) car problems is LEAKING BATTERY ACID, which causes all sorts of vehicular mayhem.&nbsp; Open the hood and look at your battery.&nbsp; If there is any corrosion or wetness, it is leaking acid.&nbsp;</p>\r\n\r\n<p>The acid/corrosion can travel through the battery cables and cause electrical problems.</p>\r\n\r\n<p>It can also leak under the battery and damage anything underneath: wiring harnesses, frame, etc.</p>\r\n\r\n<p>Replace the battery.&nbsp; Install those gooey felt washers around the battery posts.&nbsp; Install an acid-absorbing mat under the battery.</p>\r\n\r\n<p>I have seen people spend thousands of $$$ to correct problems caused by leaking acid.</p>\r\n\r\n<p>Prevention is the best medicine.</p>\r\n\r\n<p>Not sure why designers/engineers insist on placing so many crucial components under the battery.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 29, 2009 10:40:55 AM"
    },
    {
      "_id": "60f734215459a36078cd89d6",
      "id": 72009,
      "title": "How to correctly charge a discharged or dead battery. ",
      "body": "<p>This explains the ideal method.<br />\r\n<br />\r\nThis applies to typical car/truck batteries; lead-acid type, 99.9% of vehicles have this type of battery.<br />\r\n<br />\r\nDisconnect both battery terminals/cables from the battery.<br />\r\n<br />\r\nMeasure the voltage of the battery with a digital voltmeter.<br />\r\n<br />\r\nAllow the battery to recover to as close to 12 volts as possible, this may take 1 hour or more. Batteries are 12.6 volts; that is the voltage they naturally &quot;want&quot; to be.<br />\r\n<br />\r\nConnect an electronic, automatic battery charger to the battery. (Available at&nbsp;Target,&nbsp;Walmart, etc., for about $50.00 and up)<br />\r\n&nbsp;<br />\r\nFollow the charger&#39;s instructions and allow the battery to charge fully.&nbsp;&nbsp;This may require up to 12 hours.<br />\r\n&nbsp;<br />\r\nIf this charging procedure is unsuccessful, the battery has failed and must be replaced.</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 31, 2009 9:31:22 AM"
    },
    {
      "_id": "60f7347a5459a36078cd89d7",
      "id": 72010,
      "title": "Factory Warranty Tips",
      "body": "<p><strong>Ask Youself This Question:&nbsp;</strong></p>\r\n\r\n<p>&nbsp;As a dealer technician, I perform many warranty repairs.&nbsp; At times, some of the concerns I address&nbsp;seem quite trivial.</p>\r\n\r\n<p>I wish people would consider the following:&nbsp;&nbsp;</p>\r\n\r\n<p>1) If the&nbsp;vehicle was out&nbsp;of warranty, would the &#39;problem&#39; bother you?&nbsp; Or would you ignore it?</p>\r\n\r\n<p>2) If the warranty was expired, would you be willing to pay&nbsp;a reasonable price for the repair?&nbsp; Or would you just drive the car and not worry about it?</p>\r\n\r\n<p>3) Did you or some other person cause the damage?&nbsp; Is the problem due to abuse?</p>\r\n\r\n<p>The new-car warranty is like an insurance policy.&nbsp; It protects the consumer against design defects and premature part failures.</p>\r\n\r\n<p><strong>&quot;That dealership avoids doing my warranty work!&quot;&nbsp;</strong></p>\r\n\r\n<p>Wrong.&nbsp; The dealership wants and needs to do warranty work.&nbsp; The service department depends on warranty repairs for a portion of it&#39;s profit stream.</p>\r\n\r\n<p>The dealership submits warranty repair orders to the manufacturer and the manufacturer pays the dealer.&nbsp; It&#39;s that simple.&nbsp; The dealership does not &#39;eat&#39; warranty repairs.&nbsp; The dealer makes a profit on all warranty repair orders.</p>\r\n\r\n<p>Keep in mind that the dealer has to follow specific rules regarding warranty repair orders.&nbsp; Failing to follow these rules results in a &quot;chargeback&quot; and causes the dealer to lose money.</p>\r\n\r\n<p>The dealer will do any and all warranty repairs that it can submit and be reimbursed for.</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 30, 2009 11:13:40 AM"
    },
    {
      "_id": "60f735495459a36078cd89d8",
      "id": 72011,
      "title": "Dear Customer, Please tell us the whole story...  ",
      "body": "<p><strong>This is one of my favorite tales of auto-repair hell.</strong></p>\r\n\r\n<p>Customer brought vehicle in and states that the engine drive belt comes off at times.&nbsp; (He was able to reinstall the belt himself.)&nbsp; This particular vehicle was a 1998 Dodge Caravan.&nbsp; He wanted us to check the belt system for a cause.</p>\r\n\r\n<p>I inspected the drive belt, pulleys and accessories, but could find no problem.&nbsp; Road tested, no problem.&nbsp; Customer picked up the van and went on his way.&nbsp; A few days later, he returned with the same concern.&nbsp; Checked it again, no problems found.&nbsp; This went on and on for some time.&nbsp;</p>\r\n\r\n<p>Finally the customer revealed an important clue:&nbsp; the belt seemed to come off (sometimes) after he used the windshield washer.&nbsp; Now, I was onto something.&nbsp; Pressing the washer button, I found a leak in the washer hose that just&nbsp;happened to spray a stream directly onto the belt.&nbsp; The slippery washer fluid would&nbsp;cause the belt to slip right off&nbsp;the pulleys!</p>\r\n\r\n<p>As it turned out, there was road construction near his home.&nbsp; Every morning, he would drive through a dusty section of road, and use the washer to clean the windshield, then the belt would come off.</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jul 9, 2009 12:15:23 PM"
    },
    {
      "_id": "60f735895459a36078cd89d9",
      "id": 76001,
      "title": "1999-2004 Jeep Grand Cherokee HVAC repair instructions. ",
      "body": "<p>Please read everything before you begin.&nbsp;Work smart and work safe! &nbsp;Your Jeep should be on level ground, and blocked so it cannot roll. During&nbsp;some portions of the repair, the transmission will be in neutral, and the parking brake will be released.&nbsp;It is very important that the vehicle does not roll away!&nbsp;</p>\r\n\r\n<p>Tools: &nbsp;Normal hand tools are necessary, including but not limited to:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>5.5mm deep socket, &frac14;&rdquo; drive (if your Jeep is equipped with grab handles on the a?pillars)&nbsp;</li>\r\n\t<li>8mm socket&nbsp;</li>\r\n\t<li>10 mm socket&nbsp;</li>\r\n\t<li>13 mm socket&nbsp;</li>\r\n\t<li>10mm wrench&nbsp;</li>\r\n\t<li>Various size extensions&nbsp;</li>\r\n\t<li>ratchets&nbsp;</li>\r\n\t<li>Needle?nose pliers&nbsp;</li>\r\n\t<li>#2 phillips stubby (short) screwdriver&nbsp;</li>\r\n\t<li>#2 phillips screwdriver (a cordless drill with a screwdriver tip will save you time and effort)&nbsp;</li>\r\n\t<li>Air tools and electric impacts are optional&nbsp;</li>\r\n</ul>\r\n\r\n<p>Please do not be overwhelmed by the length of the repair procedure. &nbsp;It will probably go faster than you&nbsp;think, depending on your skill and experience.&nbsp;If you can do minor car repairs such as oil &amp; filter change, replace rotors and brake pads, replace&nbsp;alternator, remove door panel, etc., you will be able to complete the HVAC repair procedure. &nbsp;Find a&nbsp;helper or friend with some experience if necessary.</p>\r\n\r\n<p>Get ready to save money!!! &nbsp;With normal hand tools, and some time, you can replace these&nbsp;parts yourself. &nbsp;No need to pay high labor costs. &nbsp;These repair instructions are the result of&nbsp;many years of experience. &nbsp;They are written so that anyone can understand, regardless of&nbsp;experience. &nbsp;If you work carefully and follow these instructions, you will be successful.&nbsp;</p>\r\n\r\n<p><strong>Overview:</strong>&nbsp;What we are going to do, essentially is pull the dash back to gain access to the HVAC box, remove the HVAC box, disassemble the HVAC box, replace parts as necessary, then reassemble everything. Sounds easy, right? It is! Don&#39;t get me wrong, it is going to be work. You need to set aside at least one day for this procedure. It may take you as long as 2 days, or possibly as little as 8 to 10 hours. One thing I have learned over the years is that persistence pays off. Keep working, and you will succeed.Work at your own pace. Haste makes waste without fail. If you need your vehicle to be on the road tomorrow, with no other options available, do not take it apart today.</p>\r\n\r\n<p><strong>Plan ahead:&nbsp;</strong>There is a good chance you will need to run and get an additional part, and probably at that time, the part store will be closed. Here are some tips that apply to any auto repair job: when you remove a part, lay it on the floor. Set the next part you take off next to that part. Make a long row of parts that are in order. The idea is that when you go to reassemble, it is so easy when you can start at one end and work your way through all the parts. Eliminates guessing which part goes on before which part. Another tip: find an old cardboard box. When you take a bolt out, punch a hole in the box with a screwdriver, put the bolt through that hole then write down on the box where that bolt went.</p>\r\n\r\n<p><strong>Abbreviations I will use in the following instructions:&nbsp;</strong></p>\r\n\r\n<ul>\r\n\t<li>R* means remove&nbsp;</li>\r\n\t<li>D* means disconnect&nbsp;</li>\r\n\t<li>HVAC stands for Heating, Ventilation, and Air Conditioning&nbsp;</li>\r\n</ul>\r\n\r\n<p>I have broken the overall job down into smaller&nbsp;jobs that you can accomplish one at a time.&nbsp;Evacuate the A/C system (remove the refrigerant from the A/C system).&nbsp;You&nbsp;may want to find a nearby shop to do this. &nbsp;It is illegal per EPA to vent the refrigerant to the&nbsp;atmosphere. &nbsp;Be careful when working with refrigerant&hellip;it can freeze your skin or eyes. &nbsp;Use&nbsp;common sense, caution, and safety glasses.</p>\r\n\r\n<p><strong>Prepare the vehicle:</strong></p>\r\n\r\n<ol>\r\n\t<li>R* front floor mats.</li>\r\n\t<li>Move front seats all the way back.</li>\r\n\t<li>Disconnect the vehicle battery. &nbsp;(Do not skip this step. &nbsp;You do not want airbags going off while&nbsp;you are working. &nbsp;They can kill you!!!)</li>\r\n\t<li>Empty out the center console and glove box.</li>\r\n\t<li>Remove steering column: Tilt the steering wheel down using the tilt lever.</li>\r\n\t<li>R*&nbsp;the trim cover that is above the steering column and below the instrument cluster. &nbsp;Pull toward&nbsp;you to R*. &nbsp;If there is a switch on this trim cover, disconnect it.</li>\r\n\t<li>R* fuse box bottom cover (black plastic piece). &nbsp;Pull down to R*.</li>\r\n\t<li>R* left sill trim next to driver seat. &nbsp;Pull up to R*.</li>\r\n\t<li>R* left kick panel. &nbsp;Has (3) screws and (1) plastic clip.</li>\r\n\t<li>R* Knee blocker panel. &nbsp;Has (2) screws top, (1) screw on side, (2) 10mm bolts below. &nbsp;Pull aft to&nbsp;remove.</li>\r\n\t<li>R* steering column covers. &nbsp;Has (1) screw bottom. &nbsp;Special screw, do not confuse. &nbsp;Pull top&nbsp;cover up and bottom cover down to R*.&nbsp;Look for a black bracket under steering column. &nbsp;Has (4) 10 mm bolts.&nbsp;R*.</li>\r\n\t<li>D* all electrical connectors to steering column. &nbsp;Look for (2) on the ignition switch, (1) on each&nbsp;multifunction stalk, and (1) on the immobilizer module. Look at the main harness to steering&nbsp;column: &nbsp;if it is retained to the dash structure, pry out the retainer clip. Insert key into ignition&nbsp;and turn to &lsquo;on&rsquo; position.</li>\r\n\t<li>R* the black interlock cable from the column. &nbsp;It has a release tab.&nbsp;Pull it out of the column. &nbsp;Remove ignition key. &nbsp;&nbsp;</li>\r\n</ol>\r\n\r\n<p>Look down on the steering shaft near the brake pedal for a 13mm bolt on the steering shaft. &nbsp;R*&nbsp;this bolt. &nbsp;Note: on reassembly, this is a critical bolt. &nbsp;You do not want to forget to tighten this&nbsp;one! &nbsp;Push the steering coupler forward, away from the steering column.</p>\r\n\r\n<blockquote>\r\n<p><strong>Note</strong>: now&nbsp;that the steering wheel can turn, DO NOT &nbsp;let it turn&hellip; a little is OK&hellip;but if it spins around and &nbsp;<br />\r\naround, the airbag clockspring will break. &nbsp;Use masking tape or whatever to prevent the&nbsp;<br />\r\nsteering wheel from turning.</p>\r\n</blockquote>\r\n\r\n<p>R* (4) 10mm nuts that hold the steering column to the dash. &nbsp;The steering column should be&nbsp;free ofthe vehicle atthis point. &nbsp;Set it aside.&nbsp;R* center console: has (2) screws forward of shifter, under rubber mat, (2) screws&nbsp;under cupholder insert, and 2 screws in the bottom of the cubby under the console lid. &nbsp;Pull&nbsp;plastic cubby out. &nbsp;Fully extend the rear cupholder of the center console. &nbsp;Look for and R* (3)&nbsp;screws. Push the rear cupholder back in. &nbsp;The center console should be totally loose now.</p>\r\n\r\n<p>Pull&nbsp;the parking brake up, pretty tight, and put the shifter in &ldquo;N&rdquo;. &nbsp;Gently lift and twist the center&nbsp;console as necessary to R* and set aside.</p>\r\n\r\n<p>Take a break&hellip;have a cold beverage of your choice!</p>\r\n\r\n<p>Now that the steering column and center console are&nbsp;out, you have some room to work. &nbsp;Let&rsquo;s R* some easy&nbsp;trim parts.</p>\r\n\r\n<ol>\r\n\t<li>R* the &lsquo;A&rsquo; pillar trim, both sides. &nbsp;The &lsquo;A&rsquo; pillar is forward of the front door, adjacent to the&nbsp;windshield. &nbsp;The &lsquo;B&rsquo; pillar is aft of the front door. &nbsp;Get it? &nbsp;If your vehicle has grab handles on the&nbsp;&lsquo;A&rsquo; pillars, gently pull out the rubber plugs.</li>\r\n\t<li>Now you will need a 5.5mm deep socket to R* the&nbsp;bolts where the plugs came out.</li>\r\n\t<li>Pull &ldquo;A&rsquo; pillar trim toward you to R*. &nbsp;&nbsp;</li>\r\n</ol>\r\n\r\n<p>Dash top trim panel (covers dash speakers and defrost vent): &nbsp;pry up to R*. &nbsp; Now you will see&nbsp;(4) 10mm nuts that hold the top of the dash to the body. R* all (4).&nbsp;Pry the defrost vents&nbsp;forward to disengage them from the dash. &nbsp;They should &lsquo;pop&rsquo;, but remain in place. &nbsp;This step is&nbsp;important.&nbsp;R* metal bracket forward of shifter, bottom of dash. &nbsp;Has (2) 10mm bolts and (2) 13mm nuts.&nbsp;Look to the right of where the steering column was???there should be a strap (looks like seat&nbsp;<br />\r\nbelt material) that goes from dash to shifter area. &nbsp;D* it from the dash, has (1) 13mm nut.&nbsp;R* gearshift. D* (1) elec. connector aft end. &nbsp;Pry shift cable to side to D*. &nbsp;(Has (2) shift&nbsp;cables if 4WD). &nbsp;Squeeze retainers to remove cables from shifter base. &nbsp;4WD cable has a metal&nbsp;clip&mdash;pry up to R*. &nbsp;Gently pull metal part of interlock cable to disengage it from the&nbsp;mechanism. Hard to explain. &nbsp;Look carefully. &nbsp; R* (4) 13mm nuts???shifter should come right&nbsp;out. &nbsp;Set aside. &nbsp;Look at the large wiring harness that comes from the dash and goes past the shifter.</p>\r\n\r\n<p>Pry it out from the retainers, but leave the harness in place&hellip;you will need the &lsquo;slack&rsquo; later when&nbsp;you pull the dash back. We have a fewthings todo inthedriver floor area. &nbsp;&nbsp;Look atthe fuse box. &nbsp;D* big connectors by loosening the 10mmfastenersin the center ofthe&nbsp;connectors. &nbsp;(The fastener is retained in the connector). &nbsp;D* the white connectors from the fuse&nbsp;box. &nbsp;Move wiring aside. &nbsp;Far left side of dash, R* (2) 10mm bolts. &nbsp;These hold the dash to the&nbsp;body.</p>\r\n\r\n<p>Interlock cable from shifter to column: &nbsp;if there is an elec connector, D* it.&nbsp;Look near the gas pedal&hellip;there should be (2) 10mm bolts that hold the HVAC case to the dash&nbsp;structure&hellip;(1) bolt points forward, (1) bolt points sideways. &nbsp;R* both.</p>\r\n\r\n<p>R* the small plastic duct that goes from the HVAC case to the duct that is integral with the&nbsp;carpet.</p>\r\n\r\n<p>Now for the best part&hellip;the SECRET, HIDDEN nut!!! &nbsp;Near the brake pedal, up out of sight, reach&nbsp;up, sort of almost behind the instrument cluster, there will be a 13mm nut. &nbsp;R*. &nbsp;This nut holds&nbsp;the dash to the body. &nbsp;If you absolutely cannot find it, it is possible that someone else did not&nbsp;reinstall it, if the dash has been out before. &nbsp;Use a light and a mirror to inspect.</p>\r\n\r\n<p>Left side of dash should be loose. Give it a tug to see. We&rsquo;re getting closer.&nbsp;Move to the passenger side floor area&hellip;we have a few&nbsp;things to do.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>R* the duct to the carpet just like on the driver side.</li>\r\n\t<li>Open the glove box.</li>\r\n\t<li>R* all the screws that hold the glove box trim surround to the dash.</li>\r\n\t<li>R*&nbsp;both trim pieces.</li>\r\n\t<li>R* (2) 10mm black bolts (they point down) that hold the dash structure to the&nbsp;HVAC case.</li>\r\n\t<li>Close the glove box.</li>\r\n\t<li>R* the sill trim and kick panel just like you did on the driver side.&nbsp;</li>\r\n</ul>\r\n\r\n<p>Behind the kick panel you just removed, you will see (2) large electrical connectors.</p>\r\n\r\n<ul>\r\n\t<li>D* the&nbsp;bottom one, has 10mm fastener similar to the large connectors on the fuse block on the driver&nbsp;side.</li>\r\n\t<li>D* the radio antenna connector also -&nbsp;pull to separate.&nbsp;</li>\r\n</ul>\r\n\r\n<p>Near the blower motor, between the HVAC case and the firewall, there are (2) elec connectors,&nbsp;up and out of sight, but they are easy to reach. D* both. &nbsp;These connect the dash wiring to the&nbsp;HVAC case wiring, and MUST be D*.</p>\r\n\r\n<p>R* (2) 10mm bolts on far right of dash, similar to driver side. &nbsp;Dash should be loose. &nbsp;Near the&nbsp;(2) bolts, there probably is a retainer tab that sort of &lsquo;snaps&rsquo; the dash to the body. &nbsp;It can be&nbsp;pried if necessary. You are almost ready to pull the dash!!!</p>\r\n\r\n<p>Slowly and gently pull the dash back a bit, and with a light, observe carefully and look for&nbsp;anything that might still be connected. &nbsp;Do this on both sides. &nbsp;Check again to be sure.</p>\r\n\r\n<p>Enlist a&nbsp;helper -&nbsp;it is nearly impossible to do this next part by yourself.</p>\r\n\r\n<p>Lower the parking brake handle (ensure that the vehicle will not roll!!!) &nbsp;Place a blanket (a&nbsp;cushion) on the parking brake handle. Push both seat belt buckles back towards the rear. &nbsp;This will prevent them from denting the&nbsp;dash pad.</p>\r\n\r\n<p>What you are going to do now, with your helper, is pull the dash assembly back, rotate it 90&nbsp;degrees, and set it on the seats. &nbsp;The A/C vents will be face?down on the seats.&nbsp;The dash is out!</p>\r\n\r\n<p>Time for some work under the hood.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>R* battery. &nbsp;Has a 10mm hold down bolt.</li>\r\n\t<li>R* coolant overflow bottle (leave the hose connected). &nbsp;Has (2) 10mm bolts. &nbsp;Set aside.&nbsp;</li>\r\n</ul>\r\n\r\n<p>If equipped with 4.7L V8, R* the TCM (transmission computer). &nbsp;Note: the TCM is mounted to a&nbsp;black bracket. &nbsp;Unbolt the bracket to remove TCM. &nbsp;Has (3) 10mm bolts. &nbsp;Elec connector to TCM&nbsp;has (1) 8mm bolt, loosen to D*. &nbsp;Pry loose wiring retainers as necessary.&nbsp;R* PCM (engine computer) bolted to firewall. &nbsp;D* connectors (have release tabs top and&nbsp;bottom, be gentle). &nbsp;Has (2) 10mm nuts top, and (1) 10mm nut which you will find in the&nbsp;fenderwell, above the tire. &nbsp;PCM most likely has a ground strap, D* it or just lay the PCM on top&nbsp;of the engine, out of the way. &nbsp;D* connectors and move wiring around as needed to make room. &nbsp;Now for the hard part&hellip;the heater hoses. &nbsp;Use needle-nose pliers to squeeze the clamps and&nbsp;pull the clamps forward. &nbsp;If you are cussing, take a break. &nbsp;Be patient,&nbsp;these clamps can be a pain. Gently twist and pry and do your best to get the heater hoses off the heater core tubes. &nbsp;There is no perfect method. &nbsp;A hair dryer may help if the hoses are cold. &nbsp;A hose loosening tool&nbsp;(basically a pointed screwdriver with a 90 degree bend at the tip) will help. &nbsp;Keep in mind that if&nbsp;you damage the heater core tubes, you will have to replace the heater core, which probably is a&nbsp;good idea anyway, since they do have a tendency to leak. &nbsp;Try not to puncture the hoses. &nbsp;You&nbsp;will lose a little coolant, but not much. &nbsp;Plug hoses as necessary.</p>\r\n\r\n<p>D* the refrigerant lines. &nbsp;First, double-check that the refrigerant is empty. &nbsp;(Take one of the fill&nbsp;caps off and press the valve down with a screwdriver.) &nbsp;Some models have 2 lines. &nbsp;Most have a&nbsp;block (the expansion valve) which has (1) 13mm nut. &nbsp;It\u001fs OK if the stud comes out with the&nbsp;nut. &nbsp;Leave the lines in place. &nbsp;They will come apart when you pull the HVAC case out later. Look along the fire wall to yourright, pastthe A/C lines,find the 10mmbolt. It may be hard to<br />\r\nsee. &nbsp;Use a flashlight. &nbsp;It is up fairly high. &nbsp;This bolt holds the HVAC case to the firewall. &nbsp;R* bolt.&nbsp;This step cannot be skipped.</p>\r\n\r\n<p>Go back to the passenger floor area. &nbsp;Look under the HVAC case and R* (2) 10mm silver nuts. These hold the HVAC case to the firewall. &nbsp;HVAC case should be loose now, ready to pull. &nbsp;Slowly and gently rock it a bit, pull aft and it&nbsp;should start to move. &nbsp;Double check for anything still connected. &nbsp;Sometimes, the heater core&nbsp;tubes melt into the firewall padding -&nbsp;if this is the case, the HVAC case will give more&nbsp;resistance. &nbsp;Be careful. &nbsp;Look under the hood to make sure everything is coming apart as it&nbsp;should.</p>\r\n\r\n<p>Pull the HVAC case out, be careful not to scratch the door panel. &nbsp;It is bulky but not very heavy.&nbsp;Set HVAC case on the floor.&nbsp;Disassemble HVAC case.&nbsp;I normally sit on the floor to disassemble the case. &nbsp;Remove defrost duct (has 3 screws). &nbsp;Set aside.&nbsp;</p>\r\n\r\n<p>Take a minute or two to study the case and familiarize yourself with how it is laid out.&nbsp;The recirc door is located above the blower motor.</p>\r\n\r\n<p>Unplug recirc door actuator. &nbsp;Remove 2&nbsp;screws and pry 2 clips to remove recirc door. &nbsp;Check the door -&nbsp;if it is flopping around, it needs&nbsp;to be replaced. &nbsp;It is very common for this door to be broken. &nbsp;If you do get a new recirc door, it&nbsp;does not come with the seal. &nbsp;You can remove the seal and glue it on the new recirc door, or&nbsp;order a new seal from the dealer.&nbsp;R* both blend door actuators. &nbsp;(1) on the front of case, (1) on back. &nbsp;Have (2) screws each. &nbsp;Set&nbsp;aside. &nbsp;Mark them with a sharpie marker.&nbsp;R* the heater core. &nbsp;Has (3) screws which hold 3 clamps which hold the tubes in place. R* the&nbsp;(3) screws and clamps. &nbsp;Gently pull the heater core from the HVAC box and set aside. &nbsp;Inspect it&nbsp;for tube damage and also for any leaks. &nbsp;Replace it if in doubt.</p>\r\n\r\n<blockquote>\r\n<p><strong>I&rsquo;m guessing that you do not wish to re-do this job. Look at the case and you will see a line where the top separates from the bottom.</strong></p>\r\n</blockquote>\r\n\r\n<p>Begin to work your way around the case and remove all the gold colored screws along this split line. &nbsp;While you are at it, disconnect wiring along the way. &nbsp;When you see a metal clip in pace of a screw, mark that spot and remove the clip. &nbsp;At the end of the case opposite the blower fan, you will see an actuator with a complicated mechanism. &nbsp;This is the mode door actuator. &nbsp;Remove the (1) screw that is surrounded by a white plastic washer. &nbsp;Pull the part that was retained by that screw. &nbsp;Gently, but may take some force. &nbsp;Leave all other mechanisms in place. &nbsp; Carefully begin to splitthe case. &nbsp;Examine for anything still connected and pullthe top case half free fromthe bottomcase half. &nbsp;There is(1)seal which is glued to both the upper and lower case: cut it carefully with a razor blade or sharp knife to allow the HVAC case to come apart.</p>\r\n\r\n<p>Pull the evaporator out. &nbsp;Check for a wire to the evaporator (the temp sensor). Some but not all are equipped - If you are replacing the evaporator, you MUST transfer the temp sensor to the new evaporator.</p>\r\n\r\n<p>Pull out the Styrofoam piece under the evaporator. &nbsp;It is very fragile.</p>\r\n\r\n<p>Now you can see those darned blend doors&hellip;they are next to the evaporator. &nbsp;There are (2) screws holding the blend doors subassembly to the case. &nbsp;Sometimes the blend doors are totally broken and loose. &nbsp;Other times, they look OK at first, but if you turn the shaft you will see that the shaft is loose from the blend door itself. &nbsp;If the blend doors are loose or broken in any way, you have found the root cause for your no?heat condition. &nbsp;Replace them.</p>\r\n\r\n<p>Clean the inside of the HVAC box as necessary. &nbsp;Make very certain that the evaporator drain is clear -&nbsp;blow through it with air or pour some water through it. HVAC case seals: &nbsp;these seals are made from foam, and have a tendency to deteriorate over time. &nbsp;Replace as necessary. &nbsp;They are all available from the dealer. &nbsp;<strong>ALWAYS replace the evaporator drain seal.</strong>&nbsp;&nbsp;Check to see if the seal stuck to the firewall. This happens sometimes.</p>\r\n\r\n<blockquote>\r\n<p><strong>The evaporator drain seal is very important! &nbsp;It prevents condensate water from the&nbsp;evaporator from leaking inside the vehicle.&nbsp;</strong></p>\r\n</blockquote>\r\n\r\n<p>I usually replace the case top seal. It tends to be disturbed during disassembly. &nbsp;Also check the&nbsp;seals around the heater core tubing and the evaporator tubing. &nbsp;These seals keep engine noise&nbsp;and odor out of the passenger compartment.&nbsp;Do not forget the seal on top of the recirc door.&nbsp;Reassemble the HVAC box:&nbsp;<br />\r\nMake certain you are not forgetting anything -&nbsp;look around your work area. &nbsp;Simply reverse the&nbsp;above steps to reassemble. &nbsp;A little WD-40 or silicone spray on the evaporator will help it slide&nbsp;together more easily. &nbsp;Watch the evap temp sensor wiring: make sure it is not pinched.&nbsp;As you slide the case top back on, you will have to adjust the positions of the mode doors&hellip;take&nbsp;your time. &nbsp;If you are having to force anything -&nbsp;stop. &nbsp;Pull the case top back off and have a&nbsp;look. &nbsp;Make sure everything is lining up.</p>\r\n\r\n<p>With the case top on, put a few screws in, and inspect your work so far. &nbsp;Turn the blend door&nbsp;shafts to check for smooth movement. &nbsp;Check the mode doors also. &nbsp;Continue with assembly.</p>\r\n\r\n<p><strong>Actuators:</strong>&nbsp;&nbsp;there is a good chance that the blend or recirc actuators will not go back on,&nbsp;because the actuator output shaft is clocked wrong. &nbsp;When the door failed, the actuator turned to a position thatit would not normally be in. &nbsp;No problem: I usemy 9.6v cordless drill battery&nbsp;and 2 pieces of wire to turn the actuator. &nbsp;Just give it power and ground on the actuator&nbsp;terminals. &nbsp;Any battery will do. &nbsp;Reverse the wiring to turn it the other way. &nbsp;The actuator gets&nbsp;power and ground to turn in one direction, and reverse polarity to turn in the other direction.</p>\r\n\r\n<p><strong>Test actuators:</strong>&nbsp;&nbsp;once the HVAC box is all back together, use your battery and wires to run the&nbsp;actuators back and forth several times. &nbsp;Watch the mode doors and their mechanisms for&nbsp;proper movement. &nbsp;It is normal for the mode door mechanism to make some noise as it moves. &nbsp;This step is important: &nbsp;if you have a failed actuator, now is the time to find it, rather than when&nbsp;the dash is back on.</p>\r\n\r\n<p><strong>Reinstall HVAC box:</strong>&nbsp;Examine the evaporator tubing o-rings: normally I reuse these. &nbsp;Prepare to reinstall the HVAC box.&nbsp;Care and caution is key! &nbsp;Have a helper under the hood to help you guide the tubing through&nbsp;the firewall holes. &nbsp;Once the case is in place, slightly tighten the (2) 10mm case bottom nuts to&nbsp;hold it in place. Push the case UP somewhat while you tighten the nuts.</p>\r\n\r\n<p><strong>BE CERTAIN THAT THE EVAPORATOR DRAIN SEAL IS IN PLACE.</strong></p>\r\n\r\n<p>The case should be in place. &nbsp;Go under the hood and install the 10mm black bolt that holds the&nbsp;case to the firewall. &nbsp;Tighten it slowly, and you should see the evaporator tubing move toward&nbsp;you as you tighten the bolt. &nbsp;Then do a final tightening on the case lower 10mm nuts. &nbsp;Re-loosen and shift the case around as necessary to get things to line up.</p>\r\n\r\n<p><strong>PLEASE DON&rsquo;T BE AN &ldquo;OVER-TIGHTENER!&rdquo;</strong></p>\r\n\r\n<p>This is one of the most common mistakes people&nbsp;make. &nbsp;Most of the fasteners you are dealing with are small, and over-tightening can break or&nbsp;strip them. &nbsp;Snug is fine. &nbsp;Firm and snug. &nbsp;If in doubt, leave something on the loose side rather&nbsp;than over-tightened. &nbsp;You can always retighten it later.</p>\r\n\r\n<p><strong>Reinstall the dash:</strong>&nbsp;A helper is required. One area to watch is where the dash structure goes very close to the&nbsp;mode door actuator and mechanism. &nbsp;Use the dash top studs to guide the dash onto the vehicle&nbsp;body. Once in place, you may have to wiggle the dash around some to move it into the final&nbsp;position. &nbsp;Inspect every place where the dash bolts to the body for alignment: top, sides, etc.&nbsp;Open the glove box to check where the (2) 10mm black bolts hold the dash to the HVAC case. Check near the gas pedal, where the (2) 10mm bolts hold the HVAC case to the dash structure. Once everything is lined up, reinstall and tighten all the bolts.&nbsp;</p>\r\n\r\n<p>Reverse the steps on the previous pages to reassemble everything. &nbsp;Hopefully you lined up all&nbsp;the parts in a row for easy reassembly. &nbsp;Reconnect the battery when reassembly is complete. &nbsp;At key-on, the HVAC system will do a&nbsp;calibration sequence,&nbsp;give it a few minutes to complete. &nbsp;When the calibration is finished, test<br />\r\nall the functions on the HVAC panel. Don&rsquo;t forget to refill the cooling system when you are done with reassembly. &nbsp;Use the correct&nbsp;coolant: older models use green coolant, newer models use orange coolant. &nbsp;The heater will not&nbsp;make heat until the air is purged from the heater core and hoses. &nbsp;Run the engine with the&nbsp;radiator cap off to purge the air. &nbsp;Be cautious of hot coolant.</p>\r\n\r\n<p>Congratulations! &nbsp;You have repaired your Jeep&rsquo;s HVAC system, and saved a lot of money!&nbsp;Have the A/C system recharged at a competent shop. &nbsp;Be sure to tell them about the repairs&nbsp;you performed so they will know to pull a good vacuum on the system.&nbsp;</p>\r\n\r\n<p>If you have any questions, please post them.&nbsp;If you feel there are any inaccuracies or omissions, please post that also.</p>\r\n",
      "published": 1,
      "author": "quadring",
      "publishedDate": "Jun 21, 2009 1:51:33 PM"
    },
    {
      "_id": "60f735ca5459a36078cd89da",
      "id": 1167001,
      "title": "Jeep Liberty Window Regulator Problems",
      "body": "<p>In October 2014, the U.S. District Court of Central California allowed a class-action lawsuit against Jeep/Chrysler to move forward. Chrysler has&nbsp;been replacing the regulators of the affected vehicles, mainly the 2006 and 2007 Jeep Liberty, but other Jeeps are also affected with regulator issues albeit not as frequently.&nbsp;However, the OEM replacement regulators were also failing at an alarming rate. In 2010, Chrylser extended the warranty on 2006 and 2007 Jeep Liberty vehicles to cover the faulty window situation. The warranty extends to seven years and has no mileage limit.&nbsp;This extended warranty apparently does not apply to 2006 Jeep Libertys with a build date before March 16, 2006.&nbsp;Find your Liberty&rsquo;s build date by checking the label on the edge of the driver&rsquo;s door. Chrysler Customer Service can be reached at&nbsp;<em>1&ndash;877&ndash;426&ndash;5337.</em></p>\r\n",
      "published": 1,
      "author": "iceKold",
      "publishedDate": "Jul 31, 2015 4:51:31 PM"
    },
    {
      "_id": "60f735f95459a36078cd89db",
      "id": 1167002,
      "title": "Defective TIPM on Chrysler Vehicles",
      "body": "<p>A TIPM -&nbsp;<em>Totally Integrated Power Module</em>&nbsp;-&nbsp;is responsible for controlling and distributing power to all of the electrical functions of the vehicle, including safety and ignition systems. There is a fuel pump relay inside the TIPM that can fail and cause electrical issues with not starting starting and&nbsp;stalling.&nbsp;However there have been many other reports or problems related to the TIPM, such as power windows, power locks, windshield wipers and the horn.&nbsp;In September 2014, Chrysler issued a recall on TIPMs for the 2011 Dodge Durango and Jeep Grand Cherokee models manufactured between January 5th 2010 and July 20th 2011. The only vehicles affected are the ones with either the 3.6L or 5.7L engine.</p>\r\n\r\n<p>Owners of the affected vehicles can call Chrysler at 800-853-1403 and reference recall number P54.</p>\r\n",
      "published": 1,
      "author": "iceKold",
      "publishedDate": "Aug 3, 2015 7:19:36 PM"
    }
  ]
}
