{"message":"success","data":[{"_id":"60f77bc87c72782efb1cb1f1","id":69015,"vehicle":"Most vehicles, especially with 2.7L engine (LX) (JR)","concern":"The MIL (check engine light) is on. Scan tool reveals DTC P1281 cooling system performance and/or P0128 thermostat rationality.","cause":"Low coolant. Coolant bottle has not been topped off at normal service intervals.","resolution":"Top off the cooling system with the correct type of coolant. Most late model vehicles require orange coolant. Do not mix coolant types, except in an emergency. Verify that there are no coolant leaks. It is common for the black plastic coolant housing (top front of engine) to leak. Coolant housing has one or two hose connections, coolant temp sensor and bleeder screw.","details":"(3) warm-up cycles will clear the MIL.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1da","id":65051,"vehicle":"Applies to almost all vehicles, common on Chrysler (PT) PT Cruiser with 2.4L engine.","concern":"Check engine light is on. Fault code P0340 (no cam signal at PCM). Engine may hesitate.","cause":"Camshaft position (CMP) sensor failure.","resolution":"Replace the camshaft position sensor to correct. I recommend to use a Mopar part from the dealer for best results.","details":"P0340 means that the PCM (Powertrain Control Module)(engine computer) is recording a loss of the signal generated by the camshaft position sensor. This sensor is located on the left side of the cylinder head (nearest to the air filter box).","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb200","id":71011,"vehicle":"(CS) Chrysler Pacifica","concern":"Noises from front suspension. Clicking, popping and rubbing noises.","cause":"Re-torque needed","resolution":"Two things to check on Pacifica: (1) Tighten the lower control arm bolts (at the body). (2) Tighten both CV axle nuts at the front hubs.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb203","id":71014,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee with full time 4 wheel drive.","concern":"Noise while turning sharply in parking lot. Rubbing noise/sensation.","cause":"Low fluid, or incorrect fluid in the transfer case.","resolution":"Drain and refill the transfer case. Inspect for leaks.","details":"I have seen several cases where the fluid was extremely low with no significant leak present, indicating a lack of maintenance. A special fluid is required for full time 4WD tranfer cases. Part time units usually require ATF (automatic transmission fluid.)","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb20b","id":71022,"vehicle":"2007 (JK) Jeep Wrangler","concern":"Front wipers operate but will not stop in the 'park' position. In other words, the wipers will stop in any position on the windshield when the wiper switch is turned off. Related symptom: wipers operate on low speed when the switch is in the 'intermittent' position.","cause":"The park switch inside the wiper motor is faulty.","resolution":"Replace the front wiper motor to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb210","id":71027,"vehicle":"1999-2002 (WJ) Jeep Grand Cherokee","concern":"Vehicle pulls to left or right. Brakes seem to stay applied. Front brakes getting too hot. Burning smell from front brakes. Usually happens after front brake job.","cause":"Front caliper(s) failure. Caliper(s) are sticking.","resolution":"There are two styles of front caliper. Look at the rear calipers. See the thick wire on the outboard side? (It is a type of spring for caliper retention). Check to see if the front calipers have the same type of spring (it will be larger, but same basic shape). If the front calipers have the spring, they are the old style and need to be replaced with new style calipers. The old style have a tendency to stick after a brake job.","details":"There is a repair package available which includes 2 new calipers, front pads, and sealing washers for the brake lines. Check your local dealer. New-style calipers do not have the wire spring.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb229","id":75007,"vehicle":"2004 (LH) Chrysler 300M front wheel drive 3.5L (had 150,000 miles)","concern":"Engine will not idle properly. Have to press accelerator to keep engine running. Engine stalls due to idle problem. Engine runs normally otherwise. No check engine light. Related symptom: The engine cranking speed was a bit low.","cause":"The IAC (Idle Air Control) valve was failing. It was able to influence the idle speed but not control it very well.","resolution":"Replacing the IAC valve totally resolved the problem. Initially I figured the slow cranking speed was related. The battery was original(!) and failed according to the battery tester with about 200 CCA of a 600 CCA rating. Replacing the battery got the cranking speed up to normal, but actually made the idle problem worse due to the engine computer memory loss when the battery was disconnected.","details":"n some vehicles, low cranking speed due to a bad battery causes idle problems. Not in this case. The IAC valve is located on the passenger side of the throttle body, under the throttle position sensor. The throttle body is at the rear of the intake plenum on 3.5L.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb232","id":75017,"vehicle":"2005 (LX) Chrysler 300","concern":"Instrument panel gauges are inoperative at times. The ESP/BAS warning light is on. DTC B2107 may be active.","cause":"The ignition switch is failing.","resolution":"Replace the ignition switch (electrical portion) to correct.","details":"Revised part was available.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb235","id":127001,"vehicle":"2006 -2007 Jeep Wrangler (TJ)(JK) with manual transmission (NSG370)","concern":"Customers report a squeal-like sound while clutch out. Appears to be coming from transmission. Squeal stops when clutch is depressed.","cause":"Incorrect pre-load on clutch throw-out bearing","resolution":"There is a TSB (06-002-07) for this issue. On the TJ - replace the Rod and Clutch Slave Cylinder Actuator. On the JK - replace the Washer, Spacer, Lubricant (Mopar Manual Transmission MS-9224), Adhesive, Stud N' Bearing Mount, and the Throw-out Bearing.","details":"TSB #06-002-07","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e5","id":69003,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Long crank time. Engine is hard to start. May require 2 or 3 attempts to start engine. Engine will always start. Not to be confused with a true no-start condition. This assumes the battery is OK and the cranking speed is norma.","cause":"An o-ring seal inside the fuel pump has deteriorated and is leaking. This is an INTERNAL leak. No fuel will leak outside the vehicle.","resolution":"Lower the fuel tank and replace the fuel pump assembly.","details":"This would be a good time to replace the fuel filter also.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1ee","id":69012,"vehicle":"All vehicles (ZJ) (LX) (XJ) (RS)","concern":"No start. Engine cranks but does not start. Most likely the engine died while driving. The fuel gauge shows 1/8 of a tank.","cause":"The fuel tank is totally empty. The fuel level sending unit is failing.","resolution":"Replace the fuel level sending unit, or the entire fuel pump assembly. Add fuel.","details":"Always start with the basics.","modelList":"","published":1,"author":"author","publishedOn":"","publishedDate":"2021-07-23T16:47:17.128Z"},{"_id":"60f77bc87c72782efb1cb1fa","id":71005,"vehicle":"All late model Chrysler, Jeep, and Dodge vehicles (PT) (LX) (WK) (XK)","concern":"No start. The engine does not crank or start. When key is turned to the 'start' position, nothing happens. Battery is NOT dead.","cause":"The immobilizer module is electrically 'locked up' or is otherwise non-responsive.","resolution":"Disconnect the battery for a few minutes, then reconnect the battery and retest. If the engine now will start, the immobilizer module may need to be replaced.","details":"The immobilizer module is located very close to where the key goes into the ignition lock cylinder. The immobilizer module has several names, depending on year/model: SKIM, SKREEM, WIN. Vehicles with a WIN also have a FOBIK type remote (no key).","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb21d","id":71040,"vehicle":"(KJ) Jeep Liberty","concern":"Lack of airflow from A/C vents. Blower is OK. Air is coming from the vents but seems like not enough volume.","cause":"The air inlet screen is obstructed by dust build-up.","resolution":"Operate the blower on high with the fresh air setting (NOT on recirculate). Is the air volume OK? Press the re-circulation button to turn re-circulation ON. Is the air volume less? If there is less airflow on re-circulation, remove the glove box door. Examine the screen on the air inlet for dust build-up. If present, use a hook tool to remove the screen. It is not necessary.","details":"No other models have a screen.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1de","id":65055,"vehicle":"Engines with cast iron block, mostly happens on 3.7L such as in (KJ) Jeep Liberty and Dodge products.","concern":"Diagnosis has revealed that the CKP (crankshaft position) sensor needs to be replaced. Problem: The CKP sensor cannot be removed due to the engine block is rusty. The sensor will not come out of the hole. After considerable effort, now the sensor is broken and part of it remains in the engine block.","cause":"Exposure to road salt has rusted the engine block, causing the CKP hole to become smaller.","resolution":"Light blowtorch. Burn the remains of the CKP out of the hole. The cast iron can withstand the heat. Don't worry if the CKP magnet falls inside the engine; it will be quite happy in there. Use sandpaper or a hone to clean up the CKP hole. Lube the new CKP o-ring with engine oil proir to installation.","details":"Tech Tip: On 3.7L and 4.7L engines, replace both the CKP (crankshaft position) sensor and the CMP (camshaft position) sensor at the same time. Use MOPAR parts from the dealer. Every tech has been 'burned' on this one, just replace both and be done with it.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e3","id":69001,"vehicle":"Jeep Wrangler (TJ) approx 1997-2002","concern":"The check engine light is on. Scan tool shows a fault code for the TPS (throttle position sensor) circuit. The fault is always present and is not able to be cleared. Typical repair methods have been unsuccessful (you can't fix it).","cause":"If the clockspring ribbon shorts out in a certain way, due to the circuit complexities inside the PCM, the PCM sees this condition as a TPS circuit fault. This was likely an unforeseen circumstance during the engineering phase.","resolution":"Stop whatever you are doing. Hopefully you have not replaced very many expensive parts yet. Remove the two steering column covers and disconnect the connectors going to the clockspring. Retest for the TPS fault.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e8","id":69006,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee.","concern":"Engine is overheating, mostly at stoplights. Engine does not overheat while driving. A/C will not be very cold at stoplights. This assumes the coolant is full.","cause":"The electric radiator fan is inoperative.","resolution":"Replace the electric radiator fan AND the radiator fan relay to correct. Trust me...been there, done that. If one is faulty, replace both.","details":"The radiator fan relay is a solid-state (no moving parts) electronic relay. It is located directly under the right (passenger side) headlamp. You will need to cut an access hole in the plastic support panel under the headlamp to access the relay.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1ec","id":69010,"vehicle":"Jeep Wrangler (TJ) with 4.0L engine","concern":"Loss of power. Engine feels like it is producing only about 50% of normal power. Engine runs smoothly and idles normally.","cause":"Insulation pad (attached to underside of hood) was drooping down and covering the air inlet to the air filter. Reduced airflow to engine caused the power loss.","resolution":"Remove part of the the hood insulation pad closest to the air filter box.","details":"This was a very interesting case. Another dealership had been working unsuccessfully on this vehicle. They had replaced many parts, including the whole engine! Most Wranglers are not equipped with a hood insulation pad, however, this particular vehicle was.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1ef","id":69013,"vehicle":"1993-1998 (ZJ) Jeep Grand Cherokee","concern":"DTC P0351 Ignition Coil Primary Circuit. Engine stalls at times.","cause":"PCM (engine computer) failure. The ignition coil driver inside the the PCM is failing.","resolution":"Replace the PCM.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb215","id":71032,"vehicle":"2005 (LX) Chrysler 300 with 2.7L engine.","concern":"The MIL (check engine light) is on. Scan tool reveals DTC P0340 camshaft position sensor circuit and/or P0344 camshaft sensor intermittent. Related symptom: the engine may have an extended crank time (hard to start).","cause":"Software error and failed camshaft position sensor.","resolution":"1) Flash program (update) the PCM (engine computer). 2) Replace the camshaft position sensor.","details":"The camshaft position sensor is very easy to replace. It is on the front of the engine.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d9","id":65008,"vehicle":"All vehicles (TJ) (WJ) (RS) (XK) (WK) (RS)","concern":"Loud noise/vibration from interior fan (for A/C heat)(HVAC) especially when on high speed, usually speed 3 or 4.","cause":"HVAC fan (blower motor) is out of balance. Usually caused by fan sucking in leaves or other debris.","resolution":"Remove the blower motor and inspect/clean the fan blade (squirrel cage type). Normally the blower motor is located under the passenger side dash. Most are easy to remove, held in with 3 screws, either Phillps or T20 torx. ","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb209","id":71020,"vehicle":"2004-2006 (CS) Chrysler Pacifica","concern":"Various electrical problems. Possible check engine light. Flickering lights, etc.","cause":"High resistance where wiring attaches to positive battery cable at battery.","resolution":".To test: Start engine. Turn on lights, A/C, radio, rear defrost. Monitor the temperature of the positive battery terminal. If it gets very hot (compare it to the negative battery terminal), you have found the problem. Install a new universal battery terminal to correct. Retest","details":"I have seen this problem about 6 times. Use a digital voltmeter to check for voltage drop from wiring to terminal.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb20a","id":71021,"vehicle":"2007 (JK) Jeep Wrangler","concern":"Speed control (cruise control) is inoperative.","cause":"Speed control switch (small stalk on steering wheel, right side) is faulty.","resolution":"Replace the speed control switch to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb224","id":75001,"vehicle":"1996-1998 (ZJ) Jeep Grand Cherokee. 1996-2000 (NS) Chrysler Town & Country, Dodge Caravan","concern":"ABS light is on.","cause":"The pump motor circuit is not working properly.","resolution":"Use scan tool to check ABS codes - if code pump motor circuit not working properly is found replace ABS control module.","details":"You will need reverse torx socket to remove abs module. do not remove entire hydraulic control unit as you then have to bleed entire brake system.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb22d","id":75011,"vehicle":"2007 (CS) Chrysler Pacifica","concern":"The IPod adapter (dealer installed) is inoperative. Radio operates but IPod will not play when connectedThe IPod adapter (dealer installed) is inoperative. Radio operates but IPod will not play when connected.","cause":"Software error/module lockup","resolution":"Disconnect vehicle battery for about 5 minutes. Reconnect battery.","details":"As more and more electronic systems are added to vehicles, sometimes a battery disconnect is all that is required to get things working again. Cheap fix.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb231","id":75015,"vehicle":"1993-1995 (ZJ) Jeep Grand Cherokee with automatic A/C (digital display)","concern":"Interior fan for A/C and heater operates on 'high' only. Cannot control fan speed with the knob.","cause":"The blower control resistor has failed.","resolution":"Replace the blower control resistor.","details":"It is located under the passenger side dash.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e2","id":66003,"vehicle":"2008 (RT) Dodge Caravan and Chrysler Town & Country with power sliding doors ","concern":"Power sliding doors will not close at times; they close partially, then reverse to the full open position. Condition may be intermittent.","cause":"Software error.","resolution":"Have the dealer reprogram (flash) both power sliding door modules. If the modules are already at the latest software version, or the flash does not correct the problem, further diagnosis may be required.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb201","id":71012,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Rattle noise from front suspension, over bumps.","cause":"Front shocks are loose due to worn bushings.","resolution":"Replace the front shocks.","details":"Check the upper shock bushings for lateral movement.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb218","id":71035,"vehicle":"Chrysler (PT) PT Cruiser.","concern":"The MIL (check engine light) is on. Scan tool reveals DTC P0551 power steering switch performance. Driveability is normal. No other symptoms.","cause":"The power steering pressure switch has failed.","resolution":"Replace the power steering pressure switch and top off the power steering fluid.","details":"The switch is located on the rack and pinion (steering gear). Access from under the vehicle. Most likely the switch is leaking. Clean out the two-wire connector with electrical parts cleaner or brake cleaner. Three (3) test drives should clear the MIL.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb21c","id":71039,"vehicle":"(KJ) Jeep Liberty","concern":"A/C inoperative at times. Blower is OK, but sometimes A/C blows warm air. Intermittent.","cause":"Open circuit in low pressure switch -or- A/C compressor clutch is failing.","resolution":"Ensure that the A/C system has sufficient charge to allow operation. In other words, make sure the refrigerant is not empty. Disconnect the connector to the A/C low pressure switch located on the drier near the firewall. Use a jumper wire to connect the 2 pins inside the connector. If the clutch engages and the A/C blows cold, replace the low pressure switch. It is not necessary to evacuate the refrigerant to replace the switch. Otherwise, check the wiring to the A/C clutch for power with a test light. If power is present, but the A/C clutch is not engaged, carefully tap the clutch with a hammer handle and see if it engages. If it does, the clutch is faulty and should be replaced. Or simply replace the entire A/C compressor.","details":"Perform both tests with the engine running and A/C system on.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb222","id":73001,"vehicle":"All Chrysler, Jeep, and Dodge vehicles. (JK)(ZJ)(CS)(JC)(TJ)(XJ)(PT)(KJ)(KK)(KA)(AN)(ND)(DR)(DS)(WJ)(WK)(XK)(LX)(LH)(FJ)(JR)(JS)(RT)(RS)(NS)","concern":"Alternator failure. The alternator (generator) is not charging. Electrical problems.","cause":"","resolution":"Hold on for a minute. Alternator failures are extremely rare on Chrysler, Jeep, and Dodge. You need to rule out the battery, wiring, and PCM first before replacing the alternator.","details":"The alternator is controlled by the PCM (engine computer). Again, true alternator failure is very rare. In ten years as a dealer service dept tech, I have replaced maybe five alternators.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb228","id":75006,"vehicle":"2001 (AN) Dodge Dakota pickup with 3.9L V6","concern":"The MIL (check engine light) is on. Scan tool reveals DTC P0601 Powertrain Control Module (PCM) Internal Controller Failure.","cause":"The PCM has detected an internal fault.","resolution":"The only solution is to replace the PCM. The engine will usually run normally and there will be no driveability issue or other related problems.","details":"The PCM is very easy to replace on this model. It is located under the hood, on the passenger side fender, next to the air filter box. The PCM does not need to be programmed for the engine to run. However, a scan tool should be used to program the VIN and odometer into the new PCM.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb234","id":117001,"vehicle":"2007 - 2014 Jeep Wrangler Hardtop (JK)","concern":"Leaking door seal. Seal at the on the forward diagonal section near the top is not seated properly. Water leaking into interior and pooling in floorboard. Wet carpet.","cause":"Bad factory seals (or bad installation of top)","resolution":"Some dealers are replacing seals under warranty.","details":"Some owners are reporting (on forums) that taking more care when re-installing the top has addressed the issue. Follow the proper procedure for installation and check for rubber gaskets and seals that are out of position.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d3","id":65002,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Coolant loss/have to add coolant periodically. Related symptom: Odd smell from A/C dash vents. Passenger side carpet may be wet/moist.","cause":"The heater core is leaking.","resolution":"Replace the heater core. Alternative/temporary repair: Locate the 2 heater hoses going to the firewall underhood. Cut the hoses and splice them together. Hose splices are available at any auto parts store. Vehicle will have no heat, but A/C will still operate.","details":"Heater core is leaking. Inspect the HVAC black plastic case in the passenger side footwell for evidence of leak. Coolant will run down the case and under the carpet. Leak is usually slow/minor.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d8","id":65007,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Power windows inoperative. Possibly all switches on driver door inoperative. Interior lights may not come on when driver door is opened.","cause":"Driver door module (master switch assembly) is not communicating.","resolution":"First, disconnect the battery for 10 minutes, then reconnect and retest for normal operation. This may 'unlock' the driver door module. If unsuccessful, inspect the wiring going from the driver door to the body. Carefully loosen the black rubber boot and pull back. You will probably find (1) or more broken wires. Replace the door wiring harness, or repair the wires.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1dc","id":65053,"vehicle":"Jeep Liberty (KJ) 2002-2005 (approx)","concern":"Right (or left) side tail/brake bulb keeps burning out. Customer has had bulb replaced numerous times. ","cause":"A loose reflector piece inside the tailight lens is touching the bulb. Shake the tailight to check for rattle noise.","resolution":"Replace both tailight assemblies with revised parts to correct.","details":"Design flaw","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e0","id":66001,"vehicle":"2007 (JK) Jeep Wrangler","concern":"Intermittent no start. Better description is NO CRANK. A clicking noise may be heard. Engine will later crank and start. Condition is intermittent.","cause":"Insufficient ground.","resolution":"Add a 10 gauge black wire from battery negative terminal to the engine. A good/easy place to connect it is the top alternator mounting bolt.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e4","id":69002,"vehicle":"All Chrysler/Jeep/Dodge (WJ) (AN) vehicles with 4.7L 8 cyl engine.","concern":"Idle fluctuation. Engine idle speed goes up and down. May be intermittent. Idle speed will rise to about 1200 rpm and settle back to normal. More noticeable in park or neutral.","cause":"The TPS (throttle position sensor) is beginning to fail. The closed throttle voltage reading is not accurate/fluctuates.","resolution":"Replace the TPS located on the throttle body.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1eb","id":69009,"vehicle":"All Chrysler (PT) PT Cruiser with 2.4L TURBO engine only.","concern":"Vehicle does not have enough/normal power. Engine runs smooth but not enough power. Possible 'ching-a-ling' type noise from rear of engine. Probably no check engine light.","cause":"The turbocharger has failed.","resolution":"Replace the turbocharger assembly. (Get out your checkbook on this one.) Also replace the oil supply line to the turbo.","details":"On neglected vehicles, oil sludge will build up in the oil supply line to the turbo. This will prevent oil from reaching the turbo, which causes turbo failure. Use a quality synthetic engine oil in all vehicles that are equipped with a turbocharger and change the oil at reasonable intervals.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f0","id":69014,"vehicle":"1995-2000 (FJ) Chrysler Sebring Hardtop Coupe with 2.5L V6","concern":"Engine runs poorly. Have to press accelerator to start engine. Engine tries to stall.","cause":"The EGR valve is stuck open.","resolution":"eplace the EGR valve.","details":"To test: with engine idling, locate the EGR metal tube on the upper rear of the intake manifold. Barely touch it with your finger. If it is very hot and slightly burns your finger, the EGR valve is stuck open.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1ff","id":71010,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Oil pressure gauge is inaccurate. Gauge reads 80 psi (or needle is all the way to the right if it has L - H scale) when engine is running.","cause":"The oil pressure sensor is failing.","resolution":"Replace the oil pressure sensor.","details":"Requires a special tool.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb204","id":71015,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee with limited slip differential(s)","concern":"Noise while turning sharply in parking lot. Rubbing noise/sensation.","cause":"Lack of limited slip additive in differential(s)","resolution":"Remove and clean differential cover. Reinstall/reseal cover. Add full bottle (4 oz) of limited slip additive. Fill differential with 75W-140 synthetic gear oil. Test drive vehicle to re-check for noise.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb20c","id":71023,"vehicle":"2007 (JK) Jeep Wrangler","concern":"The interior lights will not turn on using the collar switch on the left multifunction stalk. The interior lights do come on when a door is opened. Related symptom: the instrument cluster backlighting is not dimmable using the collar switch on the left stalk. When the headlamps are on, the backlighting is at full brightness and cannot be adjusted.","cause":"The left stalk multifunction switch is defective.","resolution":"Replace the left stalk multifunction switch to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb211","id":71028,"vehicle":"2001-2007 (RS) Chrysler Town & Country 2001-2007 Dodge Caravan (with power sliding doors)","concern":"Power sliding door stops operating. The door will open about 12 inches and stop. The door will close most of the way and stop. Door works normally when opened or closed manually.","cause":"Open circuit in the wiring that goes from the body to the door. Usually the ground wire is broken. The wiring harness looks like a motorcycle chain but is plastic.","resolution":"Replace the wiring harness from body to door to correct.","details":"When the chain bends at a certain point, the ground wire opens. Easy to replace.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb21f","id":71042,"vehicle":"All vehicles. (JK)(ZJ)(CS)(JC)(TJ)(XJ)(PT)(KJ)(KK)(KA)(AN)(ND)(DR)(DS)(WJ)(WK)(XK)(LX)(LH)(FJ)(JR)(JS)(RT)(RS)(NS)","concern":"The MIL (check engine light) is on. The scan tool reveals DTC P0601 PCM internal controller failure.","cause":"The PCM (engine computer) has an internal fault.","resolution":"Replace the PCM to correct.","details":"This is an easy diagnosis. When P0601 is present, the solution is always to replace the PCM. There is no other possible cause. Normally the vehicle is still driveable.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb220","id":71043,"vehicle":"This case was a 2005 (KJ) Jeep Liberty.","concern":"Both headlamps are inoperative. Will not turn on. High beams are OK. Low beam headlights will not illuminate.","cause":"Both headlamp bulbs are faulty.","resolution":"Replace both headlamp bulbs.","details":"The customer had the Jeep in our shop two days previous for some engine work. Surely the headlight problem must be related to the work we did, right? Something must be disconnected. No, it's called a coincidence. Both headlamp bulbs had broken filaments.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb22f","id":75013,"vehicle":"1995-2000 (FJ) Chrysler Sebring Hardtop Coupe with 2.5L V6","concern":"Engine cranks but will not start. May have no power to fuel pump.","cause":"Relay failure.","resolution":"Replace 1, 2, or all 3 relays located on upper firewall on driver side.","details":"One relay is for A/C compressor, one is for fuel pump, one is for ASD (automatic shut down). The fuel pump and ASD relays are crucial to engine operation.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1db","id":65052,"vehicle":"All Chrysler/Jeep/Dodge (LH) (CS) (PT) vehicles equipped with NVLD (natural vacuum leak detection) system.","concern":"The check engine light is on. Scan tool reveals code (DTC) P0440 general evaporative system failure. ","cause":"Usually caused by a failure of the switch inside the NVLD assembly.","resolution":"Replace the NVLD assembly to correct.","details":"The purpose of the NVLD system is to test the integrity of the fuel vapor containment system. For example, if the fuel filler cap was not in place, or there was a leak in the fuel tank/vapor lines/canister, the NLVD system would identify the fault and the PCM will illuminate the check engine light. This system is mandated by the EPA, to prevent evaporative emissions. All recent vehicles have this system in one form or another. Evaporative emissions are caused when gasoline evaporates into the atmosphere, which is a form of pollution. This also explains why the nozzles at gas stations have changed over the years---to prevent evaporative emissions. The NVLD system does not test the integrity of the pressurized fuel lines or fuel injectors. Note: P0440 indicates a general fault with the NVLD system. It does not neccessarily mean that there is a leak.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f4","id":69018,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Ongoing problem with brake bulbs. One or both brake bulbs is inoperative or too dim. New bulb does not solve problem, or seems to be only a temporary fix.","cause":"The 'circuit board' that holds the bulb sockets is warped or burned, causing high resistance.","resolution":"Replace the complete tail lamp assembly. These are available aftermarket for a very reasonable price.","details":"Bad design. Substitute a 3157 LED bulb to prevent this from happening again. Check ebay for the bulbs. The heat from a conventional 3157 bulb causes the circuit board to warp.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb207","id":71018,"vehicle":"This particular case was a 2003 (RS) Chrysler Town & Country minivan with 3.8L engine. Appplies to most vehicles also.","concern":"MIL (check engine light) is on. Engine runs poorly. Engine is misfiring. Power loss. Scan tool reveals DTC P0203 (fuel injector #3 control circuit) and DTC P0204 (fuel injector #4 control circuit).","cause":"Wiring to fuel injectors was damaged: wires were bare and shorting out aginst each other.","resolution":"Repair wiring and replace the PCM (engine computer).","details":"There is a 10-pin connector near the ignition coil pack that connects the engine wiring main harness to the fuel injector harness. Examine the wiring carefully: remove the conduit around the wiring to check. Removing the wiper module will improve access. The short circuit was sending battery voltage back to the PCM which fried the injector drivers inside the PCM.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb213","id":71030,"vehicle":"2006 (TJ) Jeep Wrangler","concern":"The MIL is on. Scan tool reveals DTC P0301 cylinder 1 misfire and P0300 multiple cylinder misfire. The engine seems to be running normally. Found a related symptom later: after vehicle sits for a few hours, it has a long crank time.","cause":"The fuel pump had an internal leak. The fuel pressure was dropping to -0- after the engine was shut off.","resolution":"Test fuel pressure and replace the in-tank fuel pump assembly.","details":"The leak was allowing air to enter the fuel line, which caused a cold-start misfire. This is a perfect example of why it is important to \"analyze the symptoms\" and \"look at the big picture.\" In this case, the customer did not complain about the extended crank time, but it turned out to be a contributing factor.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb217","id":71034,"vehicle":"2008 (JS) Chrysler Sebring","concern":"Speed control (cruise control) is inoperative. On/Off switch seems to be OK, but will not set.","cause":"The speed control switch is faulty.","resolution":"Replace the speed control switch to correct.","details":"New switch is a revised part.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb219","id":71036,"vehicle":"1993-1998 (ZJ) Jeep Grand Cherokee with 4.0L engine.","concern":"Chirping noise from engine. Can hear noise at idle with hood up. Seems to be coming from the distributor.","cause":"The distributor bushings are failing.","resolution":"Replace the complete distributor to correct. Recommend dealer part.","details":"There is a very specific procedure to install the distributor. Read the article here","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb230","id":75014,"vehicle":"This particular case was a 2005 (LX) Chrysler 300C RWD with 5.7L Hemi engine.","concern":"Customer's complaint was \"engine has too much power.\" I road tested and found actually the power came on too suddenly. The slightest press of the accelerator pedal would cause the car to jump forward.","cause":"The MAP (manifold absolute pressure) sensor was not reading correctly. There were no fault codes.","resolution":"Replaced the MAP sensor to correct. There was a revised part available.","details":"The MAP sensor is extremely crucial to correct engine operation, especially on engines equipped with electronic throttle control.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f2","id":69016,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"The A/C blows but is not cold (compressor will not engage). The instrument cluster backlighting is on at all times (with key on). The instrument cluster gauges are inoperative. Power windows are inoperative.","cause":"An electrical fault is disrupting the PCI Data Bus. The various modules cannot communicate with each other.","resolution":"This is not easy to resolve, however I will give you a few tips. Use a digital volt meter to measure the voltage on pin #2 of the data link connector. The data link connector is located under the driver side dash near the fuse box. It is the connector that the scan tool plugs into. Pin 2 is the PCI Bus circuit and should be a white/violet wire. The voltage with key on should be between 0 and about 2.5 volts. It will fluctuate as the modules communicate. If the voltage is too high, say 6 or more volts, you have found the cause. Unplug modules one at a time until the voltage drops and things start working again.","details":"Module examples are: PCM (engine computer), TCM (transmission computer), BCM (body computer), ABS (antilock brake module), instrument cluster, air bag computer, driver door module, passenger door module, radio, amplifier, a/c control head, overhead console computer. Sometimes disconnecting the battery for a few minutes will resolve a module-based PCI bus issue, though it may be temporary. It is also possible for the PCI bus circuit to be shorted to voltage or ground. Usually it is a module problem rather than wiring.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d6","id":65005,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"All 4 power windows inoperative.","cause":"The BCM (body control module) is electrically \"locked up\".","resolution":"Disconnect the battery for about 10 minutes. Reconnect and retest for proper operation. This should reset the BCM.","details":"Diagnosis with a scan tool should be the first step in a case such as this. A module scan with a DRBIII scan tool would have indicated that all modules were functional except the BCM. If disconnecting the battery does not resolve the issue, further diagnosis will be necessary.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb206","id":71017,"vehicle":"1993-1998 (ZJ) Jeep Grand Cherokee with 5.2L engine.","concern":"Oil leak from rear of engine. Makes a mess in the driveway where Jeep is parked.","cause":"The engine rear main seal is leaking.","resolution":"Here's a quick 'fix' that worked for me: Purchase two of those foil baking pans, size approximately 10\" long, 5\" wide, 4\" deep. Put one pan inside the other, to make it double-strength. Fill pan about half way with kitty litter. Use black plastic tie straps to secure the pan to the trans cooler lines that run directly under where the oil is leaking.","details":"The rear main seal is rather difficult to replace on 5.2L. If it is a slow leak, it may not be worth the effort/expense to repair. The catch-pan worked perfectly for me---no more mess in the driveway! Pan will have to be checked/cleaned out periodically.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb20d","id":71024,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Snapping sound when opening driver or passenger front door.","cause":"Door check strap is worn.","resolution":"Replace the door check strap to correct.","details":"Requires door panel removal.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb21b","id":71038,"vehicle":"2007 (KA) Dodge Nitro","concern":"The MIL (check engine light) is on. Scan tool reveals DTC P0456 small leak detected.","cause":"A leak in the evaporative emissions system.","resolution":"Check the vapor line just forward of the fuel tank. In this case, I found the line was loose, not fully engaged. It appeared OK at first glance. An air test with the evap smoke/air test machine confirmed that a leak was present. A smoke test revealed the source. Fully connect the vapor line to correct.","details":"The lines are snap-together (quick-connect) type. No tools required.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d7","id":65006,"vehicle":"2005 (approx) (RS) Chrysler Corp. minivans (Chrysler Town & Country and Dodge Caravan)","concern":"Power locks are inoperative. Power locks do not operate from the switches on the door panels. Power locks do not operate from remote fob.","cause":"Software error in BCM (body control module)","resolution":"Disconnect the battery for about 10 minutes, then reconnect and retest for power lock operation. If the power locks are now functional, have your dealer service dept reprogram/update (flash program) the BCM.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e6","id":69004,"vehicle":"Jeep Liberty (KJ) with 3.7L 2002-2006","concern":"Cooling system will not build pressure. Upper radiator hose is always soft, even when engine is at normal operating temperature. Coolant reservoir appears to be overfilled when engine is hot.","cause":"The radiator cap has failed and is not holding pressure.","resolution":"Replace the radiator cap, located on the coolant reservoir which is mounted on the firewall.","details":"Typically there will be no coolant leak. The system pressure is built up by the air pocket above the coolant level in the reservoir.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e9","id":69007,"vehicle":"1993-2004 (ZJ) (WJ) Jeep Grand Cherokee with 4.0L engine.","concern":"Check engine light (MIL) is on. Has P1281 engine is cold too long. No driveability symptoms. Engine is running normally.","cause":"The thermostat is stuck open. The thermostat in many cases may come out in several pieces (falling apart).","resolution":"Replace the thermostat and gasket and refill the cooling system.","details":"The PCM (engine computer) performs a rationality test on the engine cooling system. It measures engine temperature vs. engine run time. If the engine warms up too slowly, P1281 will be set and the MIL will be on.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb221","id":71044,"vehicle":"1993-1995 (ZJ) Jeep Grand Cherokee.","concern":"Turn signals flash too fast. All bulbs appear OK. Could be one or both sides.","cause":"Incorrect bulb type","resolution":"Replace the front turn signal bulb with the correct bulb: 1295NA.","details":"Any other bulb will result in fast-flashing turn signals.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb223","id":74001,"vehicle":"2002-2007 (RS) Chrysler Town & Country, 2002-2007 (RS) Dodge Caravan (equipped with rear A/C and automatic digital temperature control)","concern":"Rear climate control system blows hot air only. No cool air from rear vents. Scan tool reveals a fault code for the rear blend door.","cause":"Internal fault in the front A/C control head.","resolution":"Replaced the front A/C control head to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb226","id":75004,"vehicle":"All (LX) models: 2005-2008 Chrysler 300, 2005-2008 Dodge Charger, Dodge Magnum","concern":"Power steering leak (minor). The power steering hoses are wet. Fluid loss is very minimal in most cases.","cause":"The flexible portions of the power steering pressure hose are seeping fluid.","resolution":"Replace the power steering pressure hose to correct.","details":"The hose goes from the power steering pump to the rack & pinion.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb22a","id":75008,"vehicle":"1993-1995 (ZJ) Jeep Grand Cherokee","concern":"The engine will not start due to the factory security system (alarm) has been triggered. The factory security system is honking the horn and the exterior lights (usually the headlights) are flashing. How is the system disarmed so the engine will start?","cause":"There are two ways to disarm the system: 1) Press 'unlock' on the remote keyless entry fob. 2) Use the key in one of the exterior door locks.","resolution":"Put the key in the driver door and turn it back and forth. Keep turning until the security system disarms. If this does not work, try the passenger door and/or the liftgate. More tips: Temporarily disable the horn by removing the horn relay in the underhood fusebox/power distribution center (PDC). The underside of the lid is labeled with relay locations. Disconnect the battery, turn the igniton key 'on', and then reconnect the battery. This works occasionally.","details":"The exterior door lock key cylinders (3) have a disarm switch attached, inside the door. It is common for this switch to fail due to age/humidity/corrosion. Replace these switches as needed. The best solution is to obtain and program a remote keyless entry fob. Drastic solution: Remove the lower access panel inside the glove box. Unplug the security system module. Replace the powertrain control module. Now the security system is permanently disabled.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb22b","id":75009,"vehicle":"1993-1995 (ZJ) Jeep Grand Cherokee","concern":"How To Program a New Remote","cause":"","resolution":"Up to 4 remotes can be programmed into receiver at any given time. <br> 1) Locate the receiver...look for a black half-sphere on the rear portion of the overhead console. <br> 2) Sit in driver seat and close door. All doors should be closed. 3) Open driver's door. Leave it open through the programming procedure. 4) Slide mechanical door lock lever to the LOCK position. DO NOT use the switch. 5) Insert ignition key and turn it to RUN position. DO NOT start the engine. Within 20 seconds, aim a remote at receiver dome and press and hold lock button until the power locks cycle. (When receiver accepts programming code the driver's door will unlock.) 6) Once the first remote has been programmed, additional remotes (up to 4) may be programmed into receiver. Within 20 seconds of the previous remote programming, move the mechanical door lock lever to LOCK position. Aim another remote at receiver dome and press LOCK button for at least 5 seconds. The door lock will cycle again. 7) To lock the programmed codes into the receiver, the ignition must be turned off and back on within 20 seconds after programming the last remote's code. At that time, all previous codes are erased from the module.","details":"1993-1995 Grand Cherokees (ZJ) require a special remote that uses infared line-of-sight. This is why the remote must be aimed at the receiver dome. They are quite expensive. Check Ebay for better pricing. I have seen (1) case where the receiver was faulty.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f3","id":69017,"vehicle":"All vehicles equipped with electronic stability control (WK) (XK) (LX)","concern":"ABS/ESP/BAS light is on.","cause":"First thing to check for is an alignment problem. Test drive the vehicle and check if the steering wheel is straight when the vehicle is going straight.","resolution":"If steering wheel is turned left or right while driving straight, the vehicle needs an alignment. Perform an alignment then test drive. The warning light should turn off.","details":"The stability control computer measures steering angle and degrees per second of steering wheel rotation. When it sees steering angle greater than or less than -0-, but the yaw sensor is not sensing a turn, a rationality fault is set and the ABS/ESP/BAS light will be on.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f5","id":69019,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"One or more power door locks are inoperative. Power locks make loud 'screeching' noise.","cause":"The power lock actuator is failing. The lock actuator is inside the door latch. The door latch is the part that physically latches the door closed. It is on the rear of the door.","resolution":"Replace the latch to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f7","id":71002,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee with 4.0L engine","concern":"Possible no start and/or check engine light. One or more blown fuses in power distribution center underhood.","cause":"Wiring harness at rear of engine is shorted to ground.","resolution":"Inspect and repair wires as needed. Armor the harness to prevent future problem. A piece of heater hose makes an excellent gaurd for the harness.","details":"Inspect the harness at the rear of the valve cover. The harness will rub on the cylinder head bolt.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1fb","id":71006,"vehicle":"Most Chrysler/Jeep/Dodge vehicles, 2005 and newer (WK) (XK) (LX) (PT)","concern":"The clock (on the radio) is incorrect. What is the procedure to set the clock?","cause":"","resolution":"1) Hold the 'time' button until the clock hours digits blink. 2) Turn the right radio knob to set the hour. 3) Press the right radio knob in to select minutes. 4) Turn the right radio knob to set minutes.","details":"Easy Squeezy Lemon Peazy!","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb21a","id":71037,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"One or both exterior mirrors are floppy and loose. Will not stay in position.","cause":"The folding hinge has broken.","resolution":"Remove mirror. Drill 2 holes. Install trim screws to lock the mirror in position. Re-install mirror.","details":"Cheaper than replacing!","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb225","id":75002,"vehicle":"2008 (JS) Chrysler Sebring","concern":"Cig lighter/power outlet is inoperative.","cause":"Fuse open","resolution":"Check fuses 11 and 16 in the fuse box under the hood.","details":"The fuse numbers are on the lid of the fusebox. The fuse box is actally a control module called the TIPM (Totally Integrated Power Module).","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb22c","id":75010,"vehicle":"2007 (CS) Chrysler Pacifica","concern":"Poor radio reception. AM has no reception at all. Poor FM reception.","cause":"The radio signal amplifier has failed.","resolution":"Replace the radio signal amplifier, located on the rear roof. The mini-whip antenna screws into it.","details":"Partially lower the rear headliner to access.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb236","id":157001,"vehicle":"2007 - 2011 Jeep Wrangler (JK) with 3.8L","concern":"Excessive engine oil consumption.","cause":"Many possible causes. Owner reports include many anecdotal causes. Some major - like cracked heads, but a bad PCV valve seems to be a common issue. There are also reports of some of the 3.8s built in Mexico having piston rings installed incorrectly.","resolution":"Depends on issue causing oil consumption. Replace the PCV valve. Using a heavier oil (5w-30) has also helped some owners. Make sure to check oil at every fuel fill-up.","details":"Some frustrated owners have started a petition: http://www.ipetitions.com/petition/oilburningjeepwrangler","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1dd","id":65054,"vehicle":"Applies to all vehicles. In this case it was a 2008 (JS) Chrysler Sebring with 2.7L engine. The basic factory warranty was still in effect. ","concern":"Check engine light is on. Scan tool revealed DTC P0301 (cylinder 1 misfire). Related symptom: Technician noted the engine had a slightly rough idle, but ran OK otherwise.","cause":"Vehicle was driven through high water. The engine ingested just enough water to slightly bend cylinder #1 connecting rod. This caused the compression ratio to be reduced on cyl 1, causing a power imbalance, resulting in a rough idle and a misfire DTC.","resolution":"Remove cylinder head and oil pan and replace cyl 1 piston/rod assembly.","details":"This was yet another case where the customer withheld information. They knew the vehicle has been driven through high water, but chose to not disclose this information, perhaps hoping that the factory warranty would cover the repair. Water ingestion/flood damage is not covered by the factory warranty.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e1","id":66002,"vehicle":"The following vehicles with a console-mounted shifter: 2005 and newer (LX) body (Chrysler 300/300C, Dodge Charger, Dodge Magnum.) 2007 (JS) and newer Chrysler Sebring and Dodge Avenger.","concern":"Shifter will not come out of Park. Vehicle cannot move because shifter is stuck in Park. Vehicle operator has engine running and brake pedal IS depressed (normal operation).","cause":"Shifter internal mechanical failure.","resolution":"There is a manual override button on the rear of the shifter. It is bright pink in color. You will need to remove a trim piece or cupholder insert to access the override button. Key should be on, depress and hold brake pedal, and press and hold pink override lever. At the same time, pull the shifter toward you, out of park. It may require 2 hands and considerable force. Part of the internal shifter will break/snap and then you will be able to move the shifter to reverse, drive, etc. If you are successful, this will save you a tow bill. Replace the gearshift assembly to repair permanently.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f6","id":71001,"vehicle":"1993-1998 (ZJ) Jeep Grand Cherokee","concern":"One or more power door locks are inoperative. Power locks make 'whirling' type noise.","cause":"The power lock actuator is failing. The lock actuator is inside the door latch. The door latch is the part that physically latches the door closed. It is on the rear of the door.","resolution":"Replace the latch to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f8","id":71003,"vehicle":"1993-1998 (ZJ) Jeep Grand Cherokee","concern":"Possible no start and/or check engine light. One or more blown fuses in power distribution center under the hood.","cause":"Wiring is shorted to ground.","resolution":"Repair wiring as needed.","details":"Two places to inspect: (1) Check the downstream (rear) oxygen sensor: I have seen many cases where the wiring comes out of it's retainer and rubs on the driveshaft. (2) Inspect the wiring running down near the front of the intake manifold and close to the power steering pump (4.0L only). It is easy for this to be misrouted when the exhaust manifold is replaced. The wiring goes to the upstream (front) oxygen sensor. The wiring will melt and short out on the exhaust manifold if misrouted.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1f9","id":71004,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Power window inoperative. The window is down and will not go up. Can hear the window motor operating.","cause":"The window regulator cable is broken.","resolution":"Replace the power window regulator to correct.","details":"The new regulators from the dealer are heavily revised. I have never seen one of the new style regulators break. I have installed lower-cost aftermarket regulators that worked just fine. Replace the door panel plastic clips as needed.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb20e","id":71025,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Speakers sound terrible. Distorted.","cause":"One or both dash speakers are coming apart. The paper is rattling against the speaker frame.","resolution":"Replace the dash speaker(s) to correct.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb214","id":71031,"vehicle":"2001-2007 (RS) Chrysler Town & Country Minivan","concern":"The MIL (check engine light) is on. Scan tool reveals DTC P0455 large leak detected, P0442 medium leak detected, P0456 small leak detected. May have one, two, or all of these DTCs.","cause":"Evaporative system has a leak.","resolution":"Check for the most common leaks first: 1) The hoses going to the charcoal canister (under vehicle, near fuel tank) 2) The hoses next to the air filter box, to the purge solenoid. Remove the entire air filter box to get a good look. Examine carefully for split/cracked hoses. Replace as needed. 3) The purge solenoid is a common problem. It sometimes will have an internal leak. 4) Always consider the gas cap. Make sure it is tight.","details":"If no obvious problems are found, an EVAP smoke/air machine may be needed to diagnose.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb21e","id":71041,"vehicle":"2001-2007 (RS) Chrysler Town & Country minivans with digital automatic A/C system. 2001-2007 (RS) Dodge Caravan minivans with digital automatic A/C system.","concern":"The A/C blower runs at full speed (high) at all times when the key is on. The A/C blower is speed will not adjust with the fan speed knob.","cause":"The blower control resistor has failed.","resolution":"Replace the blower control resistor.","details":"Remove glove box door to access.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb205","id":71016,"vehicle":"This particular vehicle was my 1995 (ZJ) Jeep Grand Cherokee, but this applies to any vehicle with a fabric headliner.","concern":"Headliner fabric is falling down. Looks terrible.","cause":"Age/poor design","resolution":"ere's how to fix this cheaply and with no special tools or equipment: Remove complete headliner from vehicle. Pull the fabric off. Clean the fuzzy stuff from the panel. I used compressed air to blow it off. Obtain (1) gallon of flat black (or whatever color you prefer) latex paint and a thick nap roller. Paint the headliner and allow it to dry for a day or two. Reinstall headliner.","details":"My headliner looked so much better after painting it. Cost me about $25.00.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb216","id":71033,"vehicle":"Chrysler (PT) PT Cruiser","concern":"Front windshield washers are inoperative. Can hear the pump running, but no spray.","cause":"The washer nozzles are broken. The hoses have broken off the nozzles. The nozzles became very brittle over time due to engine heat.","resolution":"Replace both washer nozzles and clean out/repair the hose connections as needed.","details":"Cool fact: PT Cruisers have only one washer pump which supplies both the front and rear washers. A polarity-reversing system is used. When the pump turns in one direction, the front sprays. In the other direction, the rear sprays.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb227","id":75005,"vehicle":"2009 (JC) Dodge Journey","concern":"Front power windows are inoperative. Power locks are inoperative. Scan tool module scan reveals no communication from the left front door control module. All other modules are communicating. All other modules have logged a no communication DTC against the driver door module.","cause":"Left front door control module has failed.","resolution":"Check the module power, ground, and bus communication wires. If OK, replace the module.","details":"The left front door control module is attached to the left front door with 2 screws. Remove the door panel to access. Many times, a battery disconnect will get the module working again, though it may be temporary. It was unsuccessful in this case.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d4","id":65003,"vehicle":"2006 (PT) Chrysler PT Cruiser Also applies to all 2001-2007 PT Cruisers","concern":"A/C blows warm air when vehicle speed is 0mph (i.e., at a stoplight). A/C blows cold while the vehicle is moving 30mph or above. Related symptom: the engine speed will fluctuate at idle with the A/C on, due to excessive high-side pressure in the A/C system.","cause":"electric radiator fan failure.","resolution":"replace the electric radiator fan assembly.","details":"The low speed circuit in the fan is inoperative. The high speed circuit is most likely still functional which is why the engine does not overheat.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1e7","id":69005,"vehicle":"All vehicles with 3.7L and 4.7L engines. (WJ) (KJ) (DR) (AN) Jeep Liberty, Grand Cherokee, etc.","concern":"Engine is overheating after cooling system repairs. Engine is overheating after the radiator was drained/refilled for maintenance.","cause":"The cooling system was not properly bled. There is an air pocket trapped, not allowing coolant to circulate.","resolution":"Allow the engine to cool. Remove the bleeder screw. Look where the upper radiator hose attaches to the engine for the bleeder screw. It requires a 10mm hex (Allen) type tool. Sometimes the screw will be very tight. You will need to use a high quality tool and possibly considerable force to remove it. Remove the radiator cap and fill the cooling system until coolant comes out of the bleeder screw hole. Reinstall the bleeder screw. You must use thread sealant to prevent a leak. Put the radiator cap on and retest.","details":"If the bleeder screw will not come out, remove the upper radiator hose at the engine just enough for coolant to come out while filling the system. This will work in a pinch.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1ed","id":69011,"vehicle":"In this case the vehicle was a 2000 (NS) Chrysler Town & Country Minivan. Also applies to most vehicles.","concern":"A/C blows warm air at times.","cause":"Coolant leak from radiator was causing the engine to overheat. The PCM (engine computer) monitors engine temperature and disables the A/C compressor when coolant temperature rises above a predetermined level.","resolution":"Replaced the radiator and refilled cooling system.","details":"This is a perfect example of 'looking at the big picture. Diagnosis should begin with a general, common-sense visual inspection of the vehicle. If I had focused on the A/C system alone, the diagnosis would have taken much longer.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb202","id":71013,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee with AZC (automatic zone control).","concern":"Interior fan for A/C and heater is inoperative. May be intermittent.","cause":"The electrical connector to the blower control module (AKA blower resistor) has overheated and burned.","resolution":"Replace the blower resistor and splice on a new connector. See dealer for parts.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb233","id":75019,"vehicle":"2005 (LX) Chrysler 300, also all vehicles equipped with integral key/remote","concern":"The keyless entry remote (integral with igniton key) is inoperative. The power locks operate normally from the switches on the front doors.","cause":"Internal remote failure, usually a soldered connection","resolution":"Best resolution is to replace the key.","details":"Key will need to be programmed in order to function. Engine will not start and remote will not operate until the key is programmed to the vehicle with the appropriate scan tool.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1df","id":65056,"vehicle":"Jeep Grand Cherokee (WJ) with 4.7L engine. Dodge products with 4.7L engine.","concern":"The check engine light is on. Has any or all of the following DTCs: P0201 injector#1 control circuit, P0202 injector #2 control circuit, P0203, P0204, P0205, P0206, P0207, P0208. Fault is probably intermittent, and there is possibly no driveability problem associated with it.","cause":" A fault in the TPS (throttle position sensor) causes signal noise, which the PCM interprets as an injector circuit fault. This condition is very rare.","resolution":"Replace the TPS to correct the condition.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1d5","id":65004,"vehicle":"1993-1998 (ZJ) Jeep Grand Cherokee with 4.0L engine, 1999-2004 (WJ) Jeep Grand Cherokee with 4.0L engine, 1997-2001 (XJ) Jeep Cherokee with 4.0L engine, 1997-2006 (TJ) Wrangler with 4.0L engine.","concern":"Engine cranks but will not start. May have died while driving. Related symptoms: Fuel gauge shows 'empty', however the fuel tank is not empty. Volt gauge is all the way to the left (low), but the battery is not discharged.","cause":"The CKP (crankshaft position) sensor is shorted internally. Turn the key off. Unplug the CKP sensor and retest for proper gauge operation.","resolution":"Replace the CKP sensor to correct.","details":"Scan tool will show 'no response' to PCM (engine computer). This is why the fuel gauge and volt gauge are inoperative. The PCM is not functioning, so the fuel and voltage data is not bussed to the instrument cluster. When the the CKP sensor shorts internally, the PCM will not function. The connector is located on the right side of the engine, near the rear of the engine block. The CKP sensor is located on the left side all the way in the back. Usually it must be replaced from under the vehicle. This is a fairly common problem.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb208","id":71019,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"The passenger front carpet is wet. A/C condensate (water from A/C operation) is leaking inside the vehicle.","cause":"A/C condensate (water from A/C operation) is leaking inside the vehicle.","resolution":"Locate the A/C drain tube. It is located on the passenger side lower firewall, in the engine compartment. You will see a black plastic tube sticking out about 1.5 inches long. It is easy to see with 4.0L engine. With 4.7L engine, you will have to access it from below. Purchase a rubber drain tube #56000724 from dealership parts dept. Install the tube onto the exiting drain tube and clamp it with a tie strap. (The rubber drain tube should point down). Start the engine and turn the A/C to full cold/high fan. A small amount of cool air should flow from the drain tube. After a few minutes, water will begin to drip from the drain tube.","details":"This will solve your problem for about $5.00. Wet carpet needs to be lifted up and dried out. The padding under the carpet will NEVER dry out on its own. Failure to dry it out properly will result in odor, rusted body and wiring damage.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb212","id":71029,"vehicle":"2005-up (WK) Jeep Grand Cerokee, 2005-up (LX) 300, 300C, Charger, etc. and others","concern":"Airbag light is on. Passenger 'airbag off' light may be on.","cause":"The passenger seat is out of calibration.","resolution":"Have your dealer calibrate the passenger seat.","details":"The passenger seat has a weight sensing system.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1fd","id":71008,"vehicle":"All (CS) Chrysler Pacificas.","concern":"Thumping sound or sensation on acceleration from a stop.","cause":"Front and/or rear powertrain mounts are broken.","resolution":"Replace the powertrain mounts to correct.","details":"Common problem. Mounts are undersized for engine torque capability.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1fe","id":71009,"vehicle":"All (CS) Chrysler Pacificas and (RS) minivans (without electronic throttle).","concern":"Gas pedal is 'sticking', feels like it is 'popping' or hard to press.","cause":"Carbon build-up in the throttle body is causing the throttle blade to stick.","resolution":"Clean the throttle body with carb spray and an old toothbrush.","details":"","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1ea","id":69008,"vehicle":"All Chrysler (PT) PT Cruiser with 2.4L gas engine. Usually happens around 100,000 miles.","concern":"No start. Engine cranks but will not start. The engine probably died while driving. Engine sounds odd while cranking (sounds too smooth). This assumes the battery and starter are OK.","cause":"The timing belt is broken. Partially remove (pull back) the upper timing belt cover and have an assistant crank the engine. If the cam sprockets do not turn, the timing belt is broken. You may see the shredded remains of the timing belt.","resolution":"Replace the timing belt. Also replace the water pump, timing belt tensioner, and both idler pulleys to complete the repair.","details":"This is a fairly difficult job.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb1fc","id":71007,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee (with manual HVAC system)","concern":"HVAC air comes out of defrost vents only.","cause":"Loss of vacuum supply to HVAC system.","resolution":"Repair or replace the vacuum hose as needed.","details":"Inspect the vacuum hoses to the intake manifold (4.0L engine). It is common for the HVAC vacuum supply hose to soften and come off the manifold.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb20f","id":71026,"vehicle":"1999-2004 (WJ) Jeep Grand Cherokee","concern":"Vibration while braking. Pulsation is felt in brake pedal and/or steering wheel.","cause":"Brake rotors are warped. Very common problem.","resolution":"Resurface or replace the front brake rotors. Inspect the brake pads.","details":"Normally brake pulsations are caused by the front rotors, which are more likely to warp. Of course, the rear rotors can warp also in some cases. Rear warpage will probably not be felt in the steering wheel.","modelList":"","published":1,"author":"quadring","publishedOn":""},{"_id":"60f77bc87c72782efb1cb22e","id":75012,"vehicle":"1995-2000 (FJ) Chrysler Sebring Hardtop Coupe with 2.5L V6","concern":"Engine runs poorly on acceleration. Misfire DTCs may be present. Engine probably idles normally. Loss of power on acceleration.","cause":"The ignition coil is failing. It is providing weak spark.","resolution":"Replace the complete distributor assembly.","details":"The ignition coil is located inside the distributor and is not serviced separately. Use a spark tester to verify weak spark.","modelList":"","published":1,"author":"quadring","publishedOn":""}]}
